[
  {
    "url": "https://eventstructure.com/010000-org",
    "title": "010000.org",
    "title_cn": "010000.org",
    "type": "Website",
    "materials": "Web software",
    "year": "2008",
    "description_cn": "本项目探讨当代社会中买卖关系在不可预知的时间框架下的表现，并结合神学和佛教的时间观念。它旨在突出存在的短暂性，并通过数字媒介建立时间观念的概念表现。",
    "description_en": "This project explores the buyer-seller relationship in contemporary society within an unpredictable time frame, drawing on theological and Buddhist concepts of time. It aims to highlight the transient nature of existence and establish a conceptual representation of time through the digital medium.",
    "video_link": "",
    "size": "",
    "duration": "",
    "tags": []
  },
  {
    "url": "https://eventstructure.com/0x027a3704071f268443",
    "title": "Hanging on the chain",
    "title_cn": "挂在链上",
    "type": "crypto, URL",
    "materials": "Ethereum transaction",
    "year": "2018-2021",
    "description_cn": "",
    "description_en": "In 2018, I put a quote on the chain through an ethereum transaction, and in 2021 I try to put the LINK representing this transaction on the NFTs' platform for trading; have we reached a point where the transaction alone can be seen as value, or even that the transaction is art?",
    "video_link": "https://etherscan.io/tx/0x027a3704071f26844350e09920e005ac7023ef6b923f56387cdb678e4feebdc0",
    "size": "",
    "duration": "",
    "tags": []
  },
  {
    "url": "https://eventstructure.com/404404404",
    "title": "404 / 404",
    "title_cn": "404 / 404",
    "type": "Installation / 装置",
    "materials": "Ink, sponge roller / 油墨、海绵滚轮",
    "year": "2017",
    "description_cn": "",
    "description_en": "404 is the error message which appears on blocked websites in China. Translating the digital message back into analog form, 404 (2017) is aaajiao’s subtle commentary on censorship and the flow of information in our digital culture. The message is always the same, no matter the diversity of content it is covering from view. Entirely site-specific, this work takes a new form with each installation; multiplying the message 404 in a diversity of forms and contexts. - DR. RACHEL RITS-VOLLOCH",
    "video_link": "",
    "size": "",
    "duration": "",
    "tags": []
  },
  {
    "url": "https://eventstructure.com/7",
    "title": "Permanent magnet spheres",
    "title_cn": "永磁球体",
    "type": "Installation",
    "materials": "Dimension variable",
    "year": "2009-2021",
    "description_cn": "",
    "description_en": "This artwork features permanent magnet spheres in variable dimensions, serving as a permanent installation. It explores themes of magnetism and form in a physical space.",
    "video_link": "",
    "size": "",
    "duration": "",
    "tags": []
  },
  {
    "url": "https://eventstructure.com/A-Dead-Innovative-Company",
    "title": "A Dead Innovative Company",
    "title_cn": "一个死亡的创新公司",
    "type": "installation",
    "materials": "USB installation (automatic font file copy to plug in the usb flash drive), data of xindanwei, text",
    "year": "2016",
    "description_cn": "一个探索技术与创新相互作用的多媒体装置。此作品使用户能够与 USB 驱动器交互，插入后自动复制字体文件，代表数字与物理领域的融合。",
    "description_en": "A multimedia installation exploring the interplay between technology and innovation. This work allows users to engage with USB drives that automatically copy font files upon insertion, representing the fusion of digital and physical realms.",
    "video_link": "",
    "size": "",
    "duration": "",
    "tags": []
  },
  {
    "url": "https://eventstructure.com/A-I-Goooooooooogle-infiltration",
    "title": "A.I. Goooooooooogle infiltration",
    "title_cn": "人工智能, Goooooooooogle 渗透",
    "type": "video installation / 视频装置",
    "materials": "Dimension variable / 尺寸可变",
    "year": "2019",
    "description_cn": "该作品是与许聪共同完成。作品基于谷歌的AVA程序，利用并批判人工智能在感知和人类与机器互动中的角色。该装置由十个屏幕组成，展示一些日常动作，由AI标记，揭示数据在我们生活中潜在的影响。",
    "description_en": "This piece was done in collaboration with XuCong. The work bases on Google’s AVA program, which utilizes and critiques AI's role in sensory perception and human interaction with machines. The installation consists of ten screens displaying mundane actions tagged by AI, revealing the hidden influence of data in our lives.",
    "video_link": "https://aaajiao.cowtransfer.com/s/b5a530995eb14d",
    "size": "",
    "duration": "",
    "tags": []
  },
  {
    "url": "https://eventstructure.com/A-bit-A-prompt",
    "title": "A bit, A prompt",
    "title_cn": "炼丹与咒文",
    "type": "Exhibition",
    "materials": "Video, Paintings, Sculpture",
    "year": "2024",
    "description_cn": "在无限膨胀的运算力（权力）面前，我们每一个人都可能成为仅拥有微弱算力的少数群体，如果我们聚焦当下最接近可见的运算力的互联网，人们的行为正在被注意力经济下的平台算法以及无处不在的意识形态混战而异化成为了一个bit，闪烁跳动。运算力裹挟着社交媒体塞满了整个互联网并且正在以生成式ai的形式迅速蔓延到几乎所有领域，我尝试在展览中去找寻在如此的系统面前，是否存在缝隙，互联网的缝隙，缝隙中依旧流淌着解离系统权威，抚慰伤痛，化解仇恨的溪流。",
    "description_en": "For his exhibition with the gallery, Chinese Berlin based artist aaajiao seeks to face the infinitely expanding authority of computational power, and how its recent forms train us to have only feeble computing capabilities. Focusing on the internet, our closest and most visible form of computational power, aaajiao realizes works of art which track how people's behaviours are alienated from real life by the platform algorithms of the attention economy and the proliferation of pervasive ideological conflicts, turning life into merely an information bit, flickering and dancing. In the exhibition, aaajiao searches through the creation of video, paintings and sculpture for a void in such a system, for a void of the internet, where streams may still flow which dissociate from systemic authority, soothe our wounds, and dissolve these constructed configurations of distraction and hatred.",
    "video_link": "",
    "size": "",
    "duration": "",
    "tags": []
  },
  {
    "url": "https://eventstructure.com/AAAJIAO-Deep-Simulator",
    "title": "Deep Simulator",
    "title_cn": "深渊模拟器",
    "type": "Exhibition",
    "materials": "Gaming station, surreal objects, computational power system",
    "year": "2021",
    "description_cn": "《深渊模拟器》是中国艺术家aaajiao在伦敦Tabula Rasa画廊举办的个展。本次展览展出了一台游戏台和超现实的雕塑，邀请观众探索现实与虚拟交融的空间。展览探讨了“深渊游荡者”的概念，这是一个集合了展览观众和游戏玩家的混合人格，允许他们在挑战新技术与数字数据背景下的现实观念时，逐步理解存在的更深层次真理。该展览最初为2020年意大利里沃利城堡概念化，此次在伦敦的展出希望能让更多观众体验到此作品。",
    "description_en": "Deep Simulator is a solo exhibition by the Chinese artist aaajiao, held at Tabula Rasa Gallery London. This exhibition features a gaming station and surreal objects resembling tree branches, inviting viewers to explore a space that merges the real and virtual. It explores the concept of the 'Deep Wanderer,' a hybrid persona that encapsulates the exhibition's observers and players, allowing them to grasp deeper truths about existence while challenging notions of reality within the context of new technologies and digital data. Initially conceived for Castello di Rivoli in 2020, this exhibition hopes to reach a broader audience in London after being restricted to domestic visitors in Italy due to the pandemic.",
    "video_link": "",
    "size": "",
    "duration": "",
    "tags": []
  },
  {
    "url": "https://eventstructure.com/Agent",
    "title": "Agent",
    "title_cn": "",
    "type": "Video Installation",
    "materials": "Acrylic, flexible screen, Raspberry Pi player, microphone",
    "year": "2023",
    "description_cn": "",
    "description_en": "\"Agent\" borrows proprietary terms from the Large language model (LLM) document or the Cookie Book as their titles. Additionally, I have created a fictional character named \"Internet void\" in the livd2d format to serve as the protagonist of the video installations. The character draws inspiration from the fact that fungi are independent from plants, animals, and other eukaryotes, cannot perform photosynthesis, and, like plants, cannot move but can extend their habitat through the growth of mycelium and can spread over long distances through spores produced by sexual or asexual reproduction. This serves as a visual interpretation of the \"Internet void.\" The installation \"Agent,\" composed of two flexible screens, discusses the relationship between hallucinations created by AI algorithms in graphic generation and human imagination.",
    "video_link": "",
    "size": "",
    "duration": "",
    "tags": []
  },
  {
    "url": "https://eventstructure.com/Avatar",
    "title": "Avatar",
    "title_cn": "头像",
    "type": "Gif animation, screen",
    "materials": "Dimension variable / 尺寸可变",
    "year": "2017",
    "description_cn": "巴掌大的录像装置《头像》循环播放着一张似曾相识的gif头像。大颗粒像素肖像，他／她的头发在风中飘拂，他／她的性格因此得以伸张，情绪获得表达。就像众多应用中的用户以类似gif动画定义自己在虚拟世界的化身一样，《头像》也是为这个集体创作的一部无名“自画像”。",
    "description_en": "Framed in a palm-size, delicate, old-fashioned screen, this pixelated GIF animation of a teenage girl in a gust of wind (“Avatar”) translates the typical but precise social media cuteness and solitude into an anonymous portrait of a collective of users.",
    "video_link": "",
    "size": "",
    "duration": "",
    "tags": []
  },
  {
    "url": "https://eventstructure.com/BDSQ",
    "title": "BDSQ",
    "title_cn": "",
    "type": "Video",
    "materials": "datamosh",
    "year": "2011",
    "description_cn": "",
    "description_en": "A project titled BDSQ that incorporates datamoshing techniques and features elements inspired by '北斗の拳 ケンシロウVSサウザー 決着'. This piece reflects a unique blend of technology and visual artistry.",
    "video_link": "https://youtu.be/jTrTqZ-Xwds",
    "size": "",
    "duration": "",
    "tags": []
  },
  {
    "url": "https://eventstructure.com/BDSQ-II",
    "title": "BDSQ II",
    "title_cn": "",
    "type": "video installation",
    "materials": "oxhide, mediaplayer, size 30cm × 45cm × 25cm",
    "year": "2011",
    "description_cn": "",
    "description_en": "A single-channel video installation that operates for 4 minutes and 4 seconds.",
    "video_link": "",
    "size": "",
    "duration": "",
    "tags": []
  },
  {
    "url": "https://eventstructure.com/BDSQ-III",
    "title": "BDSQ III",
    "title_cn": "",
    "type": "media sculpture",
    "materials": "acrylics painting on PMMA, metal material",
    "year": "2011",
    "description_cn": "",
    "description_en": "A media sculpture featuring a unique blend of acrylic painting applied on PMMA and metal materials. The dimensions are 180cm x 130cm.",
    "video_link": "",
    "size": "",
    "duration": "",
    "tags": []
  },
  {
    "url": "https://eventstructure.com/Berlin-Wall-sound-collection-project",
    "title": "Berlin Wall sound collection project",
    "title_cn": "",
    "type": "Mixer Installation",
    "materials": "handheld devices, sensor",
    "year": "2008",
    "description_cn": "",
    "description_en": "A sound collection project created by aaajiao, with sound by yao yuan and hardwave by aaajiao and majian.",
    "video_link": "",
    "size": "",
    "duration": "",
    "tags": []
  },
  {
    "url": "https://eventstructure.com/Blog-Archaeology",
    "title": "Blog Archaeology",
    "title_cn": "博客考古",
    "type": "Installation",
    "materials": "Metal structure, acrylic, electronic weigher/ 亚克力，电子秤，金属结构",
    "year": "2010",
    "description_cn": "收集十年（1999-2008）RobotWisdom.com的网站数据，称量每年的数据重量。",
    "description_en": "Collect the website data of RobotWisdom.com for ten years (1999-2008) and weigh the annual data weight.",
    "video_link": "",
    "size": "",
    "duration": "",
    "tags": []
  },
  {
    "url": "https://eventstructure.com/Body-Shadow",
    "title": "Body Shadow",
    "title_cn": "身影",
    "type": "video installation",
    "materials": "LCD screen, metal insert",
    "year": "2015",
    "description_cn": "aaajiao乃以高安秀树关于分形理论的经典著作《分数维》（1986）为出发点，他将现代分形理论、计算机算法贯穿至他对中医的经络研究中。Aaajiao的这组现场作品集合了装置、摄影、录像等媒介，通过对人体的扫描，算法的解读，将人体内无形的能量场域外化进展览现场，并转译成为文身图案。",
    "description_en": "aaajiao’s latest videos, photographs, and installations inspired by Hideki Takayasu’s 1986 book “Furakutaru” (Fractals in Physical Science [Nonlinear science: theory & application]). Over the past years, aaajiao has been researching for a series of comparative studies between the theory of fractals and Chinese philosophy (and medical science). His algorithmic methodology enables him to scan human body and track a new set of meridian systems. Combining these algorithms with art of tattoo, he transplants this internal micro-universe into the gallery space. This attempt to represent the energy sources, by outlining these ever-changing and active channels, also portrays unanticipated aspects of the personality of individuals.",
    "video_link": "https://vimeo.com/118777940",
    "size": "",
    "duration": "",
    "tags": []
  },
  {
    "url": "https://eventstructure.com/CROSSING-STORIES",
    "title": "CROSSING STORIES",
    "title_cn": "动森交换故事",
    "type": "Performance",
    "materials": "Nintendo devices, Animal Crossing: New Horizons game",
    "year": "2020",
    "description_cn": "每周邀请一位动森玩家(集合啦！動物森友會)来$$$$岛上和我交换故事, 任何故事都可以. 准备工作, 需要拥有集合啦！動物森友會游戏以及Nintendo设备, 以及加入Nintendo会员确保可以进行互联网联机, 另外请安装 Nintendo Switch Online app方便打字或者语音。",
    "description_en": "Invite one Animal Crossing (New Horizons) player to come to $$$$ Island each week and swap stories with me, any story will do. Prep work, need to own Animal Crossing: New Horizons game and Nintendo devices, as well as joining Nintendo members, ensure that you can connect to the Internet, and Please install the Nintendo Switch Online app for easy typing and voice.",
    "video_link": "",
    "size": "",
    "duration": "",
    "tags": []
  },
  {
    "url": "https://eventstructure.com/Candy-Wrappers",
    "title": "Candy Wrappers",
    "title_cn": "糖纸",
    "type": "Video",
    "materials": "Single channel video, color; screen, cables / 单频彩色录像、屏幕、线",
    "year": "2017",
    "description_cn": "一件单频彩色录像作品，通过多彩画面和抽象表现的视角探索了数字浏览的主题，灵感来源于Chrome扩展程序'Abstract Browsing'。",
    "description_en": "A single channel video work that explores the themes of digital browsing through the lens of colorful visuals and abstract representations inspired by the Chrome Extension 'Abstract Browsing'.",
    "video_link": "https://vimeo.com/226034565",
    "size": "",
    "duration": "",
    "tags": []
  },
  {
    "url": "https://eventstructure.com/Cave",
    "title": "Cave",
    "title_cn": "洞穴",
    "type": "installation",
    "materials": "挤塑板, 天然松香, PVC, 金箔, 3d树枝打印件, 轻质粘土 / extruded board, natural rosin, PVC, gold leaf, 3d branch print, light clay",
    "year": "2019-2020",
    "description_cn": "《洞穴》是与WLL和沈赳赳共同创作的装置作品，探讨物质和空间维度，以创造沉浸式体验。",
    "description_en": "Cave is an installation created in collaboration with WLL and Shen Jiujiu. It engages with both material and spatial dimensions to create an immersive experience.",
    "video_link": "",
    "size": "",
    "duration": "",
    "tags": []
  },
  {
    "url": "https://eventstructure.com/Climate-Bits",
    "title": "Climate Bits",
    "title_cn": "气候碎片",
    "type": "Website",
    "materials": "",
    "year": "2021",
    "description_cn": "",
    "description_en": "Concept: aaajiao by 史莱姆引擎SLIME ENGINE. This work reflects on the fragmentation of climate data through an interactive web format.",
    "video_link": "https://www.slimeengine.com/oc2/aaajiao/",
    "size": "",
    "duration": "",
    "tags": []
  },
  {
    "url": "https://eventstructure.com/Cave-Simulator",
    "title": "Cave Simulator",
    "title_cn": "洞穴模拟器",
    "type": "exhibition",
    "materials": "polyurethane foam, LED installation, data visualization materials",
    "year": "2020",
    "description_cn": "AIKE荣幸呈现aaajiao个展《洞穴模拟器》，此次将集中展出其近三年的全新创作，展期将于2020年5月2日持续至2020年6月21日。今年，aaajiao把创作线索聚焦在“玩家”这一由科技、互联网和虚拟维度赋予个体的新身份上。本次展览展示了aaajiao对当前生活状态的观察，探索人们生活在一个模拟器中的概念，展现了个体如何既是玩家，也是控制者。展览力求提供丰富的观展体验，旨在引发观众对材料和痕迹的认知，而不仅限于视觉结果。作品展示了aaajiao近期对材料的研究，利用聚氨酯泡沫素材创造出自然痕迹，激发观众对其形成过程的想象。",
    "description_en": "AIKE is delighted to present aaajiao's solo exhibition \"Cave Simulator\", consisting of the artist's new works over the last three years. The exhibition will open on May 2 and will be on view until June 21, 2020. This year, aaajiao shifts the focus of his practice on the \"player\", an identity any individual could claim as a result of data technology, the Internet, and the advent of virtual dimensions. The exhibition presents aaajiao’s insight on the present conditions of life, exploring the idea that people live in a simulator where everyone can be both a player and a simulator. The engagement in a simulated state allows one to grasp vulnerability, and the exhibition aims to provide a diverse viewing experience rather than limiting the audience to mere visual outcomes. It showcases aaajiao’s recent material studies, utilizing polyurethane foam that adopts natural surface marks to provoke imagination about their formations.",
    "video_link": "https://vimeo.com/882234162",
    "size": "",
    "duration": "",
    "tags": []
  },
  {
    "url": "https://eventstructure.com/Cloud-data",
    "title": "Cloud.data",
    "title_cn": "",
    "type": "Video Installation",
    "materials": "12 × screen, acrylic, mirror algorithm for cloud, water",
    "year": "2009",
    "description_cn": "在作品《云》中，12块冰冷的纯平显示器模拟出了一小片昏暗的天空。与此同时，这个矩阵却也在数字时空中为我们营造了一片无边无垠的三维天空。由艺术家（或者更准确的说，是由计算机程序语言）生成的“白云”在虚拟空际缓慢漂过……那我们究竟该怎么去感知一个虚拟物体的质地、色彩、维度，甚至是温度呢？显然，我们目前还必须依赖知识（对现代数字化技术的了解）来做出判断。但或许在不久的将来，人体将能够“模拟”出某种“第六感”，使我们更好的去感知“数字时空”。",
    "description_en": "In his latest piece Cloud, 12 flat and cold screens simulate a small region of a dark sky, but in the other way this matrix is able to contain a boundless 3-dimension sky of a digital reality. Clouds generated by the artist’s computing language are seen flying over the screens… So how do we feel the textile dimension, the color, or even temperature…of a virtual object? Apparently, we very much rely on the knowledge understanding of the technology application, but maybe in the not far future, a sixth sense will finally be stimulated in human body to deal with the cyber reality.",
    "video_link": "https://vimeo.com/123456",
    "size": "",
    "duration": "",
    "tags": []
  },
  {
    "url": "https://eventstructure.com/Collective-Behavior",
    "title": "Collective Behavior",
    "title_cn": "集群行为",
    "type": "Sound installation",
    "materials": "Circular stereo",
    "year": "2017",
    "description_cn": "作品是与声音艺术家谭硕欣共同完成。",
    "description_en": "A collaboration of sound artist Tan Shuoxin.",
    "video_link": "",
    "size": "",
    "duration": "",
    "tags": []
  },
  {
    "url": "https://eventstructure.com/Cloud-data-1",
    "title": "Cloud.data",
    "title_cn": "",
    "type": "Computer Generated Moving Image installation",
    "materials": "cement, acrylic, screen",
    "year": "2010",
    "description_cn": "",
    "description_en": "Using computer algorithms to recreate natural processes, aaajiao created a series of clouds floating on LCD screens. The portability of the medium (liquid crystal display being the new scroll painting, as it were) is negated by either fastening the screens to suspended girders or placing them on concrete plinths. These pieces simultaneously engage the massive construction projects going on across China (with that, the wanton destruction of traditional neighborhoods) and the peaceful contemplation seen in traditional Chinese painting and writing. They also represent the exciting modes of cultural transmission in the contemporary world. At once, these pieces evoke Alfred Stieglitz’s Equivalents and sculptural Minimalism. Liam Gillick, in describing the work of Donald Judd, puts it nicely. “You are not supposed to fixate on the structures in isolation or to over rationalise them within the late modernist tendency towards reduction. The work functions best when it is allowed to hover between its connection to its given location and the rest of the relative experience we bring to the room.”",
    "video_link": "",
    "size": "",
    "duration": "",
    "tags": []
  },
  {
    "url": "https://eventstructure.com/Column",
    "title": "Column / 柱",
    "title_cn": "柱",
    "type": "Single channel video",
    "materials": "color, projector, player",
    "year": "2017",
    "description_cn": "作品是与刘晓光共同完成。身份的焦虑促使我们找到了新的角色 — 用户，以此身份为背景，利用图形学编程软件在桌面上绘制一座柱，每绘制一块就修改一次电脑系统时间，既可以前往未来，也可以回溯历史。虽然计算机的系统时间看似无限，但实际上却被开发者出于整体考虑做了限制 (OS X，1969–2038)，一种无限又有限的矛盾状态正是我们处于身体和媒体交融瞬间的现实心境。",
    "description_en": "A collaboration with Liu Xiaoguang. Anxieties over identity have prompted us to find a new role: the user. With this identity as background, we used a graphics processing software to draw a column; each time we finished a section we would modify the computer system time — it could head towards the future, and so it could trace back in history. But the computer’s sense of time that seems infinite has to do with a limitation we programmed based on an overall evaluation (1969-2038, OS X), and this state of conflict between the finite and the infinite is precisely the psychological reality we experience the moment the body and media melt together.",
    "video_link": "https://player.vimeo.com/video/225895805",
    "size": "",
    "duration": "",
    "tags": []
  },
  {
    "url": "https://eventstructure.com/Consensus-geopolitics-chain-battery",
    "title": "Consensus, geopolitics, chain, battery",
    "title_cn": "共识，地缘政治，链，电池",
    "type": "Video installation ／ 视频装置",
    "materials": "LCD screen, acrylic fittings ／ LCD显示器，压克力组件",
    "year": "2021",
    "description_cn": "该艺术作品通过LCD屏幕上的视觉和听觉体验探讨共识、地缘政治和技术依赖之间的交集。",
    "description_en": "This artwork explores the intersection of consensus, geopolitics, and technological dependencies through a visual and auditory experience on an LCD screen.",
    "video_link": "",
    "size": "",
    "duration": "",
    "tags": []
  },
  {
    "url": "https://eventstructure.com/CopyCode",
    "title": "Poetic Daily",
    "title_cn": "",
    "type": "Installation",
    "materials": "3×video 2′47′‘ 3′38′’ 2′41′‘, concept : aaajiao, computer graphics, video editing : aaajiao",
    "year": "2009",
    "description_cn": "",
    "description_en": "This installation features a thematic exploration of art that challenges societal constraints, presented in the Art Beijing 2009 Exhibition.",
    "video_link": "",
    "size": "",
    "duration": "",
    "tags": []
  },
  {
    "url": "https://eventstructure.com/Cube-Cell",
    "title": "Cube.Cell",
    "title_cn": "",
    "type": "Mixed Media Installation",
    "materials": "Concept: aaajiao, Yang2; Sound: Yang2; Software: aaajiao; Hardware: Majian",
    "year": "2007",
    "description_cn": "",
    "description_en": "Cube.Cell is a mixed media installation by artist aaajiao showcasing a unique interplay between sound, software, and visual elements. This work reflects on the nature of urban spaces and human interaction within them.",
    "video_link": "http://vimeo.com/338658",
    "size": "",
    "duration": "",
    "tags": []
  },
  {
    "url": "https://eventstructure.com/Cube-data",
    "title": "Cube.data",
    "title_cn": "",
    "type": "Video or Live performance",
    "materials": "video",
    "year": "2007",
    "description_cn": "",
    "description_en": "Cube.data is a video or live performance created by aaajiao and yang2. It features concept by aaajiao and yang2, sound by yang2, and is produced with computer graphics and video editing by aaajiao.",
    "video_link": "http://vimeo.com/1197451",
    "size": "",
    "duration": "",
    "tags": []
  },
  {
    "url": "https://eventstructure.com/DataSpectrogram",
    "title": "DataSpectrogram",
    "title_cn": "",
    "type": "desktop app",
    "materials": "N/A",
    "year": "2012",
    "description_cn": "",
    "description_en": "A spectrogram is a time-varying spectral representation that shows how the spectral density of a signal varies with time. Also known as spectral waterfalls, sonograms, voiceprints, or voicegrams, spectrograms are used to identify phonetic sounds, to analyse the cries of animals; they were also used in many other fields including music, sonar/radar, speech processing, seismology, etc. The instrument that generates a spectrogram is called a spectrograph.",
    "video_link": "",
    "size": "",
    "duration": "",
    "tags": []
  },
  {
    "url": "https://eventstructure.com/Deep-Simulator",
    "title": "Deep Simulator",
    "title_cn": "",
    "type": "Multimedia Installation",
    "materials": "Not specified",
    "year": "2020",
    "description_cn": "",
    "description_en": "On the occasion of the annual illy Prize and in conjunction with Artissima, the Castello di Rivoli Museo d’Arte Contemporanea presents the exhibition of the Chinese artist aaajiao (Xi’an, Shaanxi, 1984) Deep Simulator, 2020, a new multimedia installation designed specifically for the Manica Lunga project room of the Castello di Rivoli. The exhibition is curated by Marianna Vecellio. Enriched by modern thought developed around the Internet sphere, his practice explores the evolution of the identity of the human being assimilated by the digital world, with special attention to the concepts of representation and simulation. His works narrate the experiences of the new generation, accustomed to inhabiting the parallel worlds and saturated realities of the net. At the same time, the artist also looks at the countless possibilities offered by the digital and the numerous questions raised by this hyper-technologization. The installation presents a space at once both real and virtual: a new multimedia installation composed of an environment – a room set up with a gaming station and surreal elements on the wall evocative of tree branches designed by a digital algorithm – and a metagame. The main character of the installation is the 'Deep Wanderer', a figure that incorporates the physical person, the viewer of the exhibition, the player sitting at the gaming station and, lastly, the wanderer who takes shape in the net and starts off a metaphorical journey into the depths of its space.",
    "video_link": "",
    "size": "",
    "duration": "",
    "tags": []
  },
  {
    "url": "https://eventstructure.com/Deep-Simulator-is-a-metagame",
    "title": "Deep Simulator",
    "title_cn": "深渊模拟器",
    "type": "Game",
    "materials": "",
    "year": "2020",
    "description_cn": "深渊模拟器是一种元游戏，探索不同的游戏工具，使个人能够体验改变状态和人生、创造力与现实的新视角。",
    "description_en": "Deep Simulator is a metagame that explores different playful instruments that allow individuals to experience altered states and perspectives on life, creativity, and reality.",
    "video_link": "https://vimeo.com/967007034",
    "size": "",
    "duration": "",
    "tags": []
  },
  {
    "url": "https://eventstructure.com/Diaspora-as-History",
    "title": "Diaspora as History",
    "title_cn": "",
    "type": "Exhibition",
    "materials": "Digital media, various visual elements",
    "year": "2018-2022",
    "description_cn": "",
    "description_en": "'Diaspora as History' explores the senses and sentiments of the artist, aaajiao, who grapples with identity as a person navigating cultural and national origins. The work reflects on the complexities of Chineseness and the evolution of identity in a digital age, drawing from personal narratives and broader socio-political landscapes. Through vivid visual storytelling, aaajiao aims to address themes of mobility, belonging, and the impact of the internet on personal identity.",
    "video_link": "",
    "size": "",
    "duration": "",
    "tags": []
  },
  {
    "url": "https://eventstructure.com/Email-Trek",
    "title": "Email Trek",
    "title_cn": "邮件迷航",
    "type": "Video installation, website / 视频装置, 网站",
    "materials": "-17' LED screen / 17 寸LED 屏幕\n-PC sheet with UV print / 耐力板UV 打印",
    "year": "2016",
    "description_cn": "邮件迷航预言了邮件系统崩塌之后我们如何寻找还存在的邮件的一种想像。这个作品是与圈圈共同完成。",
    "description_en": "Email Trek describes the email system and how connections between people are lost when an email system is abandoned or ceases to exist. This work is like a prophecy. We use an automatically generated email address (https://rstudio-pubsstatic.s3.amazonaws.com/24678_8234c8 01b4134f2cb32d8077f6cd75a2.html) to find valid emails. It's like a 'Star Trek', searching out life in the universe. For us, a valid email address is evidence of life.",
    "video_link": "http://email-trek.t-h-e-s-p-a-c-e.com/",
    "size": "",
    "duration": "",
    "tags": []
  },
  {
    "url": "https://eventstructure.com/EmbeddedProject",
    "title": "EmbeddedProject",
    "title_cn": "",
    "type": "Architecture",
    "materials": "Concept: aaajiao, wang zhenfei, wang luming; Interactive: aaajiao, liu xiaoguang; Computer graphics: aaajiao, wang zhenfei; Architecture: wang zhenfei, wang luming (HHD_FUN)",
    "year": "2008",
    "description_cn": "",
    "description_en": "EmbeddedProject is an architectural project developed by aaajiao, wang zhenfei, and wang luming, receiving recognition with the Third Prize at CA’ASI 2010. This project includes elements of interaction and computer graphics, blending technology and architectural design.",
    "video_link": "",
    "size": "",
    "duration": "",
    "tags": []
  },
  {
    "url": "https://eventstructure.com/Eyes-Fur",
    "title": "Eyes Fur",
    "title_cn": "眼睛毛",
    "type": "Instagram AR",
    "materials": "made possible with the collaboration of Xu Cong and WLL. / 作品是与许聪和WLL共同完成。",
    "year": "2020",
    "description_cn": "",
    "description_en": "",
    "video_link": "",
    "size": "",
    "duration": "",
    "tags": []
  },
  {
    "url": "https://eventstructure.com/Fabric-computational-wind-OCD-search",
    "title": "Fabric, computational wind, OCD, search",
    "title_cn": "织物，计算风，强迫症，搜寻",
    "type": "Video installation ／ 视频装置",
    "materials": "LCD screen, acrylic fittings ／ LCD显示器，压克力组件",
    "year": "2021",
    "description_cn": "一个视频装置，探讨了织物与风的计算模拟之间的关系，反映了艺术家对搜索算法的强迫症。",
    "description_en": "A video installation that explores the relationship between fabric and computational simulations of wind, reflecting the artist's obsession with search algorithms.",
    "video_link": "",
    "size": "",
    "duration": "",
    "tags": []
  },
  {
    "url": "https://eventstructure.com/Faceing-system",
    "title": "Faceing system",
    "title_cn": "",
    "type": "Computer device Installation",
    "materials": "wasted computer screen, aluminium",
    "year": "2010",
    "description_cn": "",
    "description_en": "aaajiao solo exhibition: cybernetics. Size screen part 24*28*20cm aluminium part 205*38*13.8cm. Technical support: shen jiujiu.",
    "video_link": "",
    "size": "",
    "duration": "",
    "tags": []
  },
  {
    "url": "https://eventstructure.com/Fine-tuning",
    "title": "Fine-tuning",
    "title_cn": "",
    "type": "Video Installation",
    "materials": "Acrylic, custom screen, Raspberry Pi player, microphone",
    "year": "2023",
    "description_cn": "",
    "description_en": "\"Fine-tuning\" borrows proprietary terms from the Large language model (LLM) document or the Cookie Book as their titles. Additionally, I have created a fictional character named \"Internet void\" in the livd2d format to serve as the protagonist of the video installations. The character draws inspiration from the fact that fungi are independent from plants, animals, and other eukaryotes, cannot perform photosynthesis, and, like plants, cannot move but can extend their habitat through the growth of mycelium and can spread over long distances through spores produced by sexual or asexual reproduction. This serves as a visual interpretation of the \"Internet void.\" \"Fine-tuning\" deconstructs the definition of fine-tuning in the application of LLM by documenting the manual adjustment of the character's facial and body parameters (craftsmanship) during the character creation process.",
    "video_link": "https://vimeo.com/1847892907",
    "size": "",
    "duration": "",
    "tags": []
  },
  {
    "url": "https://eventstructure.com/Free-will-open-mic-GFW-confessions",
    "title": "Free will, open mic, GFW, confessions",
    "title_cn": "自由意志，开放麦，墙，告解",
    "type": "Video installation",
    "materials": "LCD screen, acrylic fittings",
    "year": "2021",
    "description_cn": "探讨自由意志和自我表达主题的视频装置。",
    "description_en": "A video installation exploring themes of free will and self-expression.",
    "video_link": "",
    "size": "",
    "duration": "",
    "tags": []
  },
  {
    "url": "https://eventstructure.com/Gfwlist",
    "title": "GFWlist",
    "title_cn": "长城长",
    "type": "installation",
    "materials": "stainless steel, thermal printer module, thermal paper",
    "year": "2010",
    "description_cn": "实际测量GFW的长度 。",
    "description_en": "Measuring the length of the GFW in reality.",
    "video_link": "",
    "size": "",
    "duration": "",
    "tags": []
  },
  {
    "url": "https://eventstructure.com/Gluttony",
    "title": "Gluttony",
    "title_cn": "暴食",
    "type": "Installation",
    "materials": "PVC sheet, Solar film",
    "year": "2018",
    "description_cn": "2018年1月6日，千高原艺术空间的1000+实验项目空间将启动新年的第一个计划，带来艺术家aaajiao的个人项目“暴食”。千高原的实验项目空间以新锐艺术家的实验性创作为主，不追求作品与主题的成熟度或完整性，而是以更加开放的姿态，探索创作与展示的可能性，并努力带来特殊的观展体验。aaajiao的创作结合了浓重的反乌托邦意识，以及对文人精神的反思。他的很多作品都致力于探索新的科技和媒体影响之下的文化与社会现象。作品涵盖了社交媒体写作，数据处理，以及网络和移动媒介下的新美学景观，将今天中国特殊的社交媒体文化和科技带入了国际艺术的讨论当中。",
    "description_en": "On 06.01.2018, the 1000+ Experimental Project Space of A Thousand Plateaus Art Space will launch the first new-year plan with a solo project - \"Gluttony\" from the artist Aaajiao. Instead of pursuing the maturity and integrity, this Experimental Project Space focuses on the experimental composition of emerging artists with a more open attitude to explore the possibility of the creation and presentation and to strive for a unique exhibition experience. Aaajiao, is the pseudonym of the young artist Xu Wenkai and the avatar of his virtual network. He was born in 1984 in one of China’s oldest cities, Xi’an, but now lives and works in Shanghai and Berlin. The composition of Aajiao contains a strong dystopian awareness and a profound reflection on literati spirits and sophistications. Many of his works are devoted to the exploration of cultural and social phenomena around the influence of new technology and media. These works, ranging from social media writing and data processing to the new aesthetic landscape through the Internet and mobile media, bring the special Chinese social media culture and technology into international art discussions. In 2018, \"Gluttony\" will continue to explore how self as an observer gets along with the self devouring the pain through gluttony. This project is part of the \"Membranization\" series, exploring human emotions in relation to machines, where the rotten fermentations of social media are unable to capture emotional changes, but material combinations depict emotional contours.",
    "video_link": "",
    "size": "",
    "duration": "",
    "tags": []
  },
  {
    "url": "https://eventstructure.com/Guard-I",
    "title": "Guard, I…",
    "title_cn": "保安，我...",
    "type": "Installation",
    "materials": "silicone, fiberglass, artificial hair, clothing, seat",
    "year": "2024 - 2025",
    "description_cn": "",
    "description_en": "\"Guard\" is an installation artwork created using silicone, 3D printing, and fiberglass, depicting the figure of a security guard bearing the artist's own face. The inspiration for this piece comes from the unique role and circumstances of security guards in Chinese society during the COVID-19 lockdowns. During this period, security guards—typically individuals from lower socioeconomic backgrounds, veterans, or increasingly unemployed college graduates—were suddenly granted temporary authority by local governments. Empowered overnight, these guards rapidly transformed from community caretakers into authoritarian enforcers, imposing harsh and sometimes brutal measures upon the very residents they once served, resulting in numerous tragedies. The artist compares this months-long, severe lockdown to a \"Stanford Prison Experiment\" involving billions of people, using the artwork to explore the moral dilemmas and struggles of individuals under extreme authoritarian conditions. By placing his own face onto the security guard figure, the artist reflects upon his own potential complicity: if placed in an increasingly extreme environment, would he also be forced to don the guard's uniform, feign sleep, avoid confronting reality, or even become an executor of oppressive power? Through \"Guard,\" the artist seeks to provoke contemplation on the human predicament under authoritarian rule, while also critically examining his own position as someone who has left Shanghai, now lives in Berlin, and holds the privilege of narrating the pains and traumas of this era.",
    "video_link": "https://eventstructure.com/Guard-I",
    "size": "",
    "duration": "",
    "tags": []
  },
  {
    "url": "https://eventstructure.com/HAL",
    "title": "HAL",
    "title_cn": "",
    "type": "video",
    "materials": "datamosh, computer graphics",
    "year": "2011",
    "description_cn": "",
    "description_en": "IBM≠Heuristic ALgorithmic is a video by aaajiao, showcasing a runtime of 33'21'‘.",
    "video_link": "",
    "size": "",
    "duration": "",
    "tags": []
  },
  {
    "url": "https://eventstructure.com/Guard-I-Long-hair",
    "title": "Guard, I…",
    "title_cn": "保安，我...",
    "type": "Installation",
    "materials": "Silicone, resin 3D printing, artificial hair, clothing, seat / 硅胶，树脂3D打印，人造毛发，服装，座椅",
    "year": "2024 - 2025",
    "description_cn": "以艺术家自身的面部与身体形态为蓝本，通过拍照结合 AI 算法生成粗模，再以传统工艺完成的一尊硅胶人偶。人偶身着常见的保安制服，坐在椅子上，仿佛在打盹。\n\n在中国，保安曾经多由退伍军人或从乡村进城务工、年龄稍长的人担任。近几年，尤其是新冠疫情之后，保安也成了不少失业年轻人的选择，与保洁、保姆一起被戏称为“吉祥三宝”。简中互联网中还流行“年轻人当保安，少走四十年弯路”的迷因。瘟疫封城期间，居民大多被限制在居所与小区内，保安在行政口头授权下承担起“关键角色”，掌握出入与秩序管理等权限，成为小区层面“最小单位的法西斯”，也是很多被封居民的瘟疫创伤。与此同时，这份工作日常往往枯燥而孤独。许多年轻保安开始经营自媒体，拍 vlog 分享日常，希望借助全民注意力经济改善低收入处境并获得关注。",
    "description_en": "Modeled on the artist’s own face and body, a rough form was generated via photography and AI, then finished by hand into a silicone figure. Dressed in a standard security uniform, the figure sits in a chair, as if drifting into a nap.\n\nIn China, security work was once largely taken by veterans and older rural migrants. Since the pandemic, it has also become a fallback for unemployed youth—jokingly grouped online with cleaners and nannies as the “Auspicious Three Treasures.” A meme on the Simplified-Chinese internet quips: “Young people becoming security guards, skipping forty years of detours.” During lockdowns, guards—under verbal administrative mandate—managed gates and order within residential compounds, becoming, at the scale of the neighborhood, “the smallest unit of fascism,” and a locus of trauma for many who were sealed in. Yet the work is often monotonous and solitary. Many young guards turned to personal channels and vlogs, hoping the attention economy might lift low wages and grant visibility.",
    "video_link": "",
    "size": "",
    "duration": "",
    "tags": []
  },
  {
    "url": "https://eventstructure.com/HTTP-404",
    "title": "GATE x SANKUANZ x aaajiao DIY \"HTTP404\" SET",
    "title_cn": "",
    "type": "Installation",
    "materials": "100% Cotton, HTTP404 roller, ink bottles",
    "year": "2019",
    "description_cn": "",
    "description_en": "\"404 is the error message which appears on blocked websites in China. Translating the digital message back into analog form, 404 is aaajiao’s subtle commentary on censorship and the flow of information in our digital culture. The message is always the same, no matter the diversity of content it is covering from view. Entirely site-specific, this work takes a new form with each installation; multiplying the message 404 in a diversity of forms and contexts. Collaborative performance - Visitors will be directly involved in 404 painting the fabric on the wall with a special roller. The fabric will be then taken down and recycled into special t-shirts that will be part of something special and meaningful for a good cause. More info soon. Do it yourself - You will also be able to purchase a special DIY set during the event, composed of a small Roller, a blank tee and some ink in order to create your own 404.",
    "video_link": "",
    "size": "",
    "duration": "",
    "tags": []
  },
  {
    "url": "https://eventstructure.com/Hard",
    "title": "Hard",
    "title_cn": "坚硬",
    "type": "installation",
    "materials": "video 43'', size 280cm × 102cm × 30cm",
    "year": "2013",
    "description_cn": "Isaac Asimov的The Three Laws of Robotics,通过污秽间隔(profanity delay)或“清除”(dump)按键的处理方式摧毁或是再造(产生歧异)The Three Laws of Robotics的理论。",
    "description_en": "Isaac Asimov's The Three Laws of Robotics, through profanity delay or the dump keys to destroy or recycle by generating inconsistency the Three Laws of Robotics theory.",
    "video_link": "",
    "size": "",
    "duration": "",
    "tags": []
  },
  {
    "url": "https://eventstructure.com/I-hate-people-but-I-love-you",
    "title": "I hate people but I love you",
    "title_cn": "我憎恨人但我爱你",
    "type": "Single channel video",
    "materials": "color, sound",
    "year": "2017",
    "description_cn": "大画幅单频录像《我憎恨人但我爱你》以电脑桌面为画面背景，短片里两位赛博格（cyborg）——一位典型科幻影视造型的仿真机器人带有亚洲女子面貌，一个由无数重叠窗口构成的生物电脑不断变化着莫比乌斯带——进行着机械、呆板、反复的对话：“……我可以当你的朋友吗？你看我像真的吗？我希望是的……” “我憎恨人但我爱你……” 这套关于科技、社交和孤独的经典的科幻范式，不仅在今天社交媒体的生活中得以应证，也在用户和操作之间重新界定人际情感的疆域。",
    "description_en": "I Hate People but I Love You, is a large format single channel video installation. Set in Mac OS, the video features two cyborgs, one of which is an anticipated Asian female android, the other in disguise of a floating Möbius strip composed of pop-up windows. Both immerse themselves in a reiterated deadpan conversation: “…May I be your friend? Do I look real to you? I hope so…” “I hate people but I love you.” The classic sci-fi paradigm of dystopian sentiments regarding social interaction and loneliness is not only proven in today's social media life, but also redefines the boundaries of interpersonal emotion between users and operations.",
    "video_link": "https://player.vimeo.com/video/225883582",
    "size": "",
    "duration": "",
    "tags": []
  },
  {
    "url": "https://eventstructure.com/I-was-dead-on-the-Internet",
    "title": "I was dead on the Internet",
    "title_cn": "我死于互联网",
    "type": "Exhibition",
    "materials": "N/A",
    "year": "2021.09.04 – 2021.09.26",
    "description_cn": "我死于互联网，我曾经以为我在这里成长。这两年困在柏林生长在庞大的顶楼阳台上，边沁式的圆形监狱，观察着所有邻居的日常，同时在互联网上求生的自己还是死去了，在冬日强风下竹叶的飘动沙沙声抹去手指摩擦屏幕留下油腻的指纹，身体沉在沙发里，黑色的皮面散发着头发的气味，灰尘包裹着真菌落在臂膀上，弥留中变成一棵红枫，冬季的红枫枯死枝蔓上蘑菇的痕迹随风飘散降落在另一具身体旁被蚂蚁搬走。失败的，沮丧的，不值一提的瞬间与念头死于互联网。",
    "description_en": "I was dead on the Internet, where I once thought I was raised. The past two years of trapping in Berlin, inhabiting on the huge penthouse balcony—the Benthamian panopticon—observing the daily routine of all the neighbours while surviving on the Internet, I still died. Under the strong winter wind, the fluttering rustle of bamboo leaves erased the greasy fingerprints left by the fingers rubbing the screen; body sunken into the sofa, with its black leather surface that smelled of hair, dust wrapped in fungus falling on the arms, on the deathbed, transforming into a red maple. The branches of the red maple dried out during the winter. Remnants left by the mushrooms were drifted away with the wind, landing next to another body and being carried away by ants. Failure, frustration, worthless moments and thoughts die on the Internet.",
    "video_link": "https://player.vimeo.com/video/604322546",
    "size": "",
    "duration": "",
    "tags": []
  },
  {
    "url": "https://eventstructure.com/I-was-dead-on-the-Internet-Wannsee",
    "title": "I was dead on the Internet",
    "title_cn": "",
    "type": "exhibition",
    "materials": "",
    "year": "2022",
    "description_cn": "",
    "description_en": "I was dead on the Internet, where I once thought I was raised. The past two years of trapping in Berlin, inhabiting on the huge penthouse balcony—the Benthamian panopticon—observing the daily routine of all the neighbours while surviving on the Internet, I still died. Under the strong winter wind, the fluttering rustle of bamboo leaves erased the greasy fingerprints left by the fingers rubbing the screen; body sunken into the sofa, with its black leather surface that smelled of hair, dust wrapped in fungus falling on the arms, on the deathbed, transforming into a red maple. The branches of the red maple dried out during the winter. Remnants left by the mushrooms were drifted away with the wind, landing next to another body and being carried away by ants. Failure, frustration, worthless moments and thoughts die on the Internet. The exhibition is a direct outcome of the deletion of aaajiao's Weibo account in 2020, exploring human and non-human vulnerability, nature and life after death in the age of surveillance.",
    "video_link": "",
    "size": "",
    "duration": "",
    "tags": []
  },
  {
    "url": "https://eventstructure.com/Jelly-data",
    "title": "Jelly.data",
    "title_cn": "",
    "type": "Interactive Installation",
    "materials": "computer graphics, video editing",
    "year": "2007",
    "description_cn": "",
    "description_en": "Interactive Installation for Sustainable Imagination Exhibition",
    "video_link": "http://vimeo.com/256225",
    "size": "",
    "duration": "",
    "tags": []
  },
  {
    "url": "https://eventstructure.com/Karesansui",
    "title": "Karesansui",
    "title_cn": "枯山水",
    "type": "Installation",
    "materials": "sponges, metal insert",
    "year": "2014",
    "description_cn": "枯山水（karesansui）或“干景”园，通常称为禅园，通过精心构造的石头、水景、苔藓、修剪的树木和灌木，运用细沙或石子铺成的波纹，创造出一种迷你化的风景。创造一种安静的氛围，其中蕴含着一种“趋势”，即一下刻的运动，此“势”就是力量：生命的力量，同时也是运动中静止的瞬间，以静制动。",
    "description_en": "Karesansui or \"dry landscape\" is made possible with the collaboration of Xu Cong (media artist). It creates a miniature stylised landscape through carefully composed arrangements of rocks, water features, moss, pruned trees and bushes, and uses gravel or sand that is raked to represent ripples in water. This art form creates a peaceful and quiet moment, embodying a 'trend' that reflects movement; this 'potential' is a power: a power of growth, but also in the stillness of instant motion, inaction. The term originally refers to a microcosmic landscape arranged with fine gravel and stones, without any water features, where 'water' is represented by sand and 'mountains' by rocks, creating tranquility that contains a trend of movement, a kind of force: a power of growth and the stillness of motion.",
    "video_link": "https://player.vimeo.com/video/102992816",
    "size": "",
    "duration": "",
    "tags": []
  },
  {
    "url": "https://eventstructure.com/Karesansui-KeeClub",
    "title": "Karesansui",
    "title_cn": "枯山水",
    "type": "Installation",
    "materials": "sponges, metal insert",
    "year": "2015",
    "description_cn": "枯山水 (karesansui) for KeeClub 历峰双墅：位于淮海中路796号，为两栋新古典主义双子别墅，分别建于1921年及1927年。曾是上海民航局、电影局办公楼旧址，浓缩了近一个世纪上海东西方文化交融的历史。",
    "description_en": "Karesansui or \"dry landscape\" is made possible with the collaboration of Xu Cong (media artist). This installation is located at KeeClub, which consists of two neoclassical twin villas built in 1921 and 1927, highlighting nearly a century of cultural fusion in Shanghai.",
    "video_link": "https://player.vimeo.com/video/140556058",
    "size": "",
    "duration": "",
    "tags": []
  },
  {
    "url": "https://eventstructure.com/Life-Mapping",
    "title": "Life Mapping",
    "title_cn": "",
    "type": "Computer Generated Moving Image installation",
    "materials": "acrylic, stainless steel, itouch",
    "year": "2011",
    "description_cn": "",
    "description_en": "Algorithm generated Turritopsis nutricula",
    "video_link": "",
    "size": "",
    "duration": "",
    "tags": []
  },
  {
    "url": "https://eventstructure.com/Limited-Landscape-Unlimited",
    "title": "Limited Landscape, Unlimited",
    "title_cn": "",
    "type": "Video Installation",
    "materials": "1*LCD screen, acrylic fittings",
    "year": "2014",
    "description_cn": "一件探讨无限风景主题的视频装置，通过LCD显示器与压克力组件展示。该作品旨在反映人类对自然与科技复杂性的感知，由刘晓光合作完成。编码开发自playfuljs。",
    "description_en": "A video installation exploring the theme of limitless landscapes, presented on an LCD screen with acrylic fittings. The work is designed to reflect the complexities of human perception of nature and technology, made possible through collaboration with Liu Xiaoguang. Code based on playfuljs.",
    "video_link": "",
    "size": "",
    "duration": "",
    "tags": []
  },
  {
    "url": "https://eventstructure.com/Light-Shadow",
    "title": "Light is shadow / 光既影",
    "title_cn": "光既影",
    "type": "Art Installation",
    "materials": "This work involves the concept of blue in the screen dimension, discussing the intersection of light and shadow.",
    "year": "2013",
    "description_cn": "我们选择的蓝色实际上是各种屏幕和投影仪的默认颜色。所有这类电子设备开机时都会提供蓝色的光。我们把屏幕看作一种新的维度，而蓝色则成为这种新空间的标识符。它就像通往新世界的门。我的作品的基本理念是在这个“蓝色”维度中。在这个区域，我们用一种新方式来解释原有的物体，光与影的结合是一种新的概念。",
    "description_en": "The blue we choose actually is the default color for all kinds of screens and projectors. All this kind of electronic device will provide a blue color when it starts. If we look at the screen as a new dimension, the blue color will be the identified symbol for this new space. It acts like a door to the new world. The basic idea of my work is within this 'blue' dimension. In this area, we explain the original object in a new way, where light and shadow are combined.",
    "video_link": "",
    "size": "",
    "duration": "",
    "tags": []
  },
  {
    "url": "https://eventstructure.com/Limited-Landscape-Unlimited-Floating",
    "title": "Limited Landscape, Unlimited Floating",
    "title_cn": "",
    "type": "installation / 装置",
    "materials": "3D printing, maglev set / 3D打印，磁悬浮套件",
    "year": "2015",
    "description_cn": "作品是与许聪，刘晓光，沈磊共同完成。",
    "description_en": "Made possible with the collaboration of Xu Cong, Liu Xiaoguang Shen Lei.",
    "video_link": "",
    "size": "",
    "duration": "",
    "tags": []
  },
  {
    "url": "https://eventstructure.com/Limited-Landscape-Unlimited-Matrix",
    "title": "Limited Landscape, Unlimited Matrix",
    "title_cn": "有限景观，无限矩阵",
    "type": "digital printing",
    "materials": "digital printing",
    "year": "2015",
    "description_cn": "作品是与刘晓光共同完成。",
    "description_en": "Made possible with the collaboration of Liu Xiaoguang.",
    "video_link": "",
    "size": "",
    "duration": "",
    "tags": []
  },
  {
    "url": "https://eventstructure.com/Limited-Landscape-Unlimited-Wave",
    "title": "Limited Landscape, Unlimited Wave",
    "title_cn": "有限的风景, 无限的波浪",
    "type": "installation (app)/ 装置 (程序)",
    "materials": "8*46' DID LCD screen, metal constructions / 8个46寸DID LCD显示器，金属结构",
    "year": "2015",
    "description_cn": "此作品是与刘晓光完成的合作装置。",
    "description_en": "A collaborative installation work made possible with the collaboration of Liu Xiongguang.",
    "video_link": "",
    "size": "",
    "duration": "",
    "tags": []
  },
  {
    "url": "https://eventstructure.com/Limited-Landscape-Unlimited-Wave-3",
    "title": "Limited Landscape, Unlimited Wave 3",
    "title_cn": "",
    "type": "Video Installation",
    "materials": "3*7' LCD screen, acrylic fittings",
    "year": "2015",
    "description_cn": "一个视频装置作品，通过视觉艺术探讨风景与感知之间的关系，在三个7寸LCD显示器上展示。",
    "description_en": "A video installation piece that explores the relationship between landscape and perception through visual art, presented on three 7-inch LCD screens.",
    "video_link": "https://player.vimeo.com/video/261277602",
    "size": "",
    "duration": "",
    "tags": []
  },
  {
    "url": "https://eventstructure.com/Lorem-Ipsum",
    "title": "Lorem Ipsum",
    "title_cn": "乱数假文",
    "type": "Single channel video, screen, cables, website",
    "materials": "单频彩色录像、屏幕、线、网站",
    "year": "2017",
    "description_cn": "作品是与圈圈共同完成。",
    "description_en": "aaajiao’s “lorem ipsum” proposes a prototype of an ideal user interface, seemingly perfect and compatible with any language, and any website or application.",
    "video_link": "https://t-h-e-s-p-a-c-e.com/lorem-ipsum/",
    "size": "",
    "duration": "",
    "tags": []
  },
  {
    "url": "https://eventstructure.com/Majorelle-x-aaajiao-LLUW",
    "title": "Majorelle x aaajiao LLUW",
    "title_cn": "",
    "type": "clothing",
    "materials": "Military M65 jacket, TPU (Thermoplastic polyurethanes), silk screen printing",
    "year": "2016",
    "description_cn": "这次合作探讨了服装与艺术的交汇点，创造了一款基于军事M65设计风格的时尚工作服夹克，融入复杂的印刷技艺以提高其艺术价值。",
    "description_en": "This collaboration explores the intersection of clothing and art, creating a stylish workwear jacket based on the Military M65 design, incorporating intricate printing techniques to enhance its artistic value.",
    "video_link": "https://vimeo.com/157851613",
    "size": "",
    "duration": "",
    "tags": []
  },
  {
    "url": "https://eventstructure.com/Membranization",
    "title": "Membranization",
    "title_cn": "膜化",
    "type": "installation / 装置",
    "materials": "PVC sheet, solar film / PVC 板、车膜",
    "year": "2017",
    "description_cn": "膜化是一件装置艺术作品，利用PVC板和太阳能薄膜创造一个沉浸式环境，邀请观众与透明度和分层的概念互动。",
    "description_en": "Membranization is an installation art piece that utilizes PVC sheets and solar films to create an immersive environment, inviting viewers to interact with the concepts of transparency and layering.",
    "video_link": "https://player.vimeo.com/video/226569797",
    "size": "",
    "duration": "",
    "tags": []
  },
  {
    "url": "https://eventstructure.com/Mindlight-data",
    "title": "Mindlight.data",
    "title_cn": "",
    "type": "Video Installation",
    "materials": "computer graphics, video editing, hardwave",
    "year": "2008",
    "description_cn": "",
    "description_en": "Video Installation for greenpix. Concept by aaajiao, with support by arthub and curated by Defne Ayas.",
    "video_link": "http://vimeo.com/1197387",
    "size": "",
    "duration": "",
    "tags": []
  },
  {
    "url": "https://eventstructure.com/Minority-Algorithm",
    "title": "Minority Algorithm",
    "title_cn": "",
    "type": "Single channel video",
    "materials": "Color, sound",
    "year": "2023 - 2024",
    "description_cn": "",
    "description_en": "Minority Algorithm, a video work discussing the void of the internet, includes stories of decentralized Counterhistory compositions in social struggles formed by the smartphone peeping perspective based on short video apps, the astonishing fact that drone killing videos in war are rapidly spread and gamified through social media with the blessing of algorithms, and the fictional narratives formed by AI computing power shaping artificial landscapes and natural disasters, as well as the devastation brought to individual laborers by the fundamental step of AI training that cannot be bypassed—manual annotation, and the alienation of people's perception of the physical world after being shaped by computing power. While I see the omnipresent computing power and algorithms, I also notice that the human heart is everywhere, and the flow of empathy and curiosity tears through the neat, proud, and expensive authority, revealing void and smelling the streams.",
    "video_link": "https://vimeo.com/912041733",
    "size": "",
    "duration": "",
    "tags": []
  },
  {
    "url": "https://eventstructure.com/NTFs_aaajiao",
    "title": "NTFs_aaajiao",
    "title_cn": "加密, zip 文件",
    "type": "File",
    "materials": "Encrypted .ZIP file folder",
    "year": "2020-2021",
    "description_cn": "一个加密的zip，当作品通过NFTs交易之后，拥有作品的人会获得Zip文件以及解压所需的密码。Zip使用的密码是在社工库中找到的aaajiao常用密码，即被破解公开的密码。通过NFTs交易，收藏者获得zip的解压密码。",
    "description_en": "NTFs_aaajiao is an encrypted .ZIP file folder that contains four images. Freely available to download but locked and encrypted, only the collector who acquired the work through an NFT transaction will receive the password to unlock the folder’s contents. This password is aaajiao’s common password found in the Social Engineering data, i.e., the password that has been cracked publicly. The file icons themselves have been edited, with a superimposed self-portrait of the artist. With contents not visible to the public, the image of the ZIP folder in its finder window container is the only visual representation available.",
    "video_link": "",
    "size": "",
    "duration": "",
    "tags": []
  },
  {
    "url": "https://eventstructure.com/Nobody",
    "title": "Nobody",
    "title_cn": "啥都不是",
    "type": "Installation",
    "materials": "3D transparent resin printing, printed car film, glasurit / 3D透明树脂打印，打印汽车膜，鹦鹉漆",
    "year": "2024 - 2025",
    "description_cn": "在一个AI 利用图片生成3D的平台上，有个公开案例：以一名亚洲男性为对象，艺术家将其3D模型用透明树脂打印，并用车模贴花工艺把头部贴图覆回实物。源图是否也是AI生成不得而知。这个随机的“亚洲男性”像标本般被测试后遗留在算力驱动的网站上——无名，却承载身份政治，如同一张孤独的身份证。",
    "description_en": "On an image-to-3D AI platform, a public case features an 'Asian male' whose model is printed in transparent resin, with the head texture reapplied by an automotive decal technique. Whether the source image was itself AI-generated is unknown. This random 'Asian male'—a specimen of sorts—remains on a compute-heavy site after testing: nameless yet burdened with identity politics, like a solitary ID card.",
    "video_link": "",
    "size": "",
    "duration": "",
    "tags": []
  },
  {
    "url": "https://eventstructure.com/Noise",
    "title": "Noise",
    "title_cn": "闹",
    "type": "Installation / App",
    "materials": "Size 280cm × 102cm × 30cm",
    "year": "2013",
    "description_cn": "白噪音纵贯电视时代和屏幕时代, 也是声音到视觉的连贯, 古老却依旧着蕴藏力量。",
    "description_en": "White noise runs through the television and screen eras, but is also the sound to the visual continuity of the ancient and still is a hidden strength.",
    "video_link": "",
    "size": "",
    "duration": "",
    "tags": []
  },
  {
    "url": "https://eventstructure.com/Obj-1-2",
    "title": "Obj. 1",
    "title_cn": "物体 1",
    "type": "Video Installation / 视频装置",
    "materials": "DID LCD screen, wood fittings / DID LCD显示器，木质组件",
    "year": "2014",
    "description_cn": "在屏幕中造物，赏物。",
    "description_en": "Create objects in the screen, enjoy objects.",
    "video_link": "",
    "size": "",
    "duration": "",
    "tags": []
  },
  {
    "url": "https://eventstructure.com/Obj-3",
    "title": "Obj.3",
    "title_cn": "",
    "type": "Video Installation",
    "materials": "LCD screen, acrylic fittings",
    "year": "2014",
    "description_cn": "在屏幕中造物，赏物。",
    "description_en": "Create objects in the screen, enjoy objects.",
    "video_link": "",
    "size": "",
    "duration": "",
    "tags": []
  },
  {
    "url": "https://eventstructure.com/Obj-4",
    "title": "Obj.4",
    "title_cn": "",
    "type": "Video Installation",
    "materials": "LCD screen, wood fittings / LCD显示器，木质组件",
    "year": "2014",
    "description_cn": "在屏幕中造物，赏物。",
    "description_en": "Create objects in the screen, enjoy objects.",
    "video_link": "",
    "size": "",
    "duration": "",
    "tags": []
  },
  {
    "url": "https://eventstructure.com/Obj-5",
    "title": "Obj.5",
    "title_cn": "",
    "type": "Video Installation",
    "materials": "2*LCD screen, wood fittings",
    "year": "2014",
    "description_cn": "在屏幕中造物，赏物。",
    "description_en": "Create objects in the screen, enjoy objects.",
    "video_link": "",
    "size": "",
    "duration": "",
    "tags": []
  },
  {
    "url": "https://eventstructure.com/Overlap",
    "title": "Overlap",
    "title_cn": "双重",
    "type": "installation",
    "materials": "LED installation, PVC sheet",
    "year": "2016",
    "description_cn": "双重 - 用光来描摹并不可见的现场状态，与现场再并置，不稳定和不准确感由此构成。",
    "description_en": "Overlap - Using light to depict the invisible state of a scene, juxtaposed with the scene itself, creating an unstable and inaccurate feeling.",
    "video_link": "https://vimeo.com/197024846",
    "size": "",
    "duration": "",
    "tags": []
  },
  {
    "url": "https://eventstructure.com/One-ritual",
    "title": "One ritual",
    "title_cn": "一个仪式",
    "type": "video",
    "materials": "Dimension variable / 尺寸可变",
    "year": "2025",
    "description_cn": "以郭老师与药水哥的标志性片段为骨架，将“耶斯莫拉”“迷hotel”“您配吗”等梗语以动态字体化作屏幕的呼吸与鼓点，让语言在复读中自我增幅，召唤出一场持续生成的“直播仪式”。看与被看在弹幕与切片之间迭代，围观者在狂欢中获得短暂连结，却在笑声散场的静默里照见“乐子人”式的疏离与空心，孤独像回声一样从喧嚣深处返场。抽象文化可被概括为一种反逻辑、反叙事、反权威的网络亚文化，通过脏话、方言、错位语义与黑话化再生产，完成对主流话语的“消解”与“滑移”。其渊源可追溯至2015年前后的直播潮与“6324”等主播社群生态，并在围观、嘲讽、二创的循环中被持续放大。抽象内容以“反常识—反精致—反逻辑”的即时愉悦为吸力，满足“娱乐至上”的观看逻辑，观众通过复读与二创获得短暂的共同体错觉。然而，围观者多以“乐子人”心态消费“他者的出丑”，以恶搞与冷嘲构筑脆弱的连接，情感承诺极低，导致共时热闹与纵深孤独并存。抽象文化提供了可快速合唱的语言模板，却难以生成稳定的社群纽带，映照出社会原子化语境中“人—人关系”的空洞化。",
    "description_en": "Built on iconic clips by Guo Laoshi and Yaoshui-ge, catchphrases like “yesmola,” “mi hotel,” and “Are you worthy?” become kinetic typography—breath and beat for the screen. Through repetition, language amplifies itself, conjuring a “livestream ritual” that keeps generating. Seeing and being seen iterate between barrages and clips; the crowd touches a fleeting bond in the carnival, only to meet, in the hush after laughter, the lezi-ren’s (fun-seeker’s) alienation and hollow core—loneliness returning like an echo from noise. “Abstract culture” names an online subculture that is anti-logic, anti-narrative, anti-authority, dissolving mainstream speech through profanity, dialect, semantic slippage, and insider jargon. Emerging from the livestream wave circa 2015 and streamer scenes like “6324,” it grows through watching, mockery, and remixes. Its pull is an instant gratification of 'anti-common sense—anti-refinement—anti-logic,' feeding a watchword of entertainment-first; viewers gain a brief illusion of commonality by repetition and remix. Yet most look on as lezi-ren, consuming others’ embarrassment with spoof and cold sneer. The ties are thin, the affect low: synchronous bustle alongside deep solitude. Abstract culture offers a chorus-ready template, but struggles to form durable bonds, reflecting how “person-to-person” relations hollow out in an atomized society.",
    "video_link": "https://vimeo.com/1113505913",
    "size": "",
    "duration": "",
    "tags": []
  },
  {
    "url": "https://eventstructure.com/Org-a",
    "title": "org.a",
    "title_cn": "org.a",
    "type": "Installation",
    "materials": "PVC sheet with UV print",
    "year": "2016",
    "description_cn": "aaajiao（徐文恺）是一位媒体艺术家和媒体与互联网活动家，他通过将1999年至2016年间中国主流新闻门户网站的首页线框结构视觉化，创建了他的新作。这件作品表现为一个数字横幅的景观，赋予了作品抽象描述的物理形式。最终，这件作品表达了对当今“数字世界”中信息消费的反对，这是一种“不产生任何有意义的”廉价而无用的消费。aaajiao将数据结构转化为变化多样的比较数字形式或“横幅”，以探讨在信息数据与日常生活愈加紧密相连的时代，人们通过消费和消化信息是否发生变化。这件作品的标题像一个组织或行动的代号，听起来像一个代码命令，隐藏着双重意图。本项目首次呈现在湖南路的REFORMERart城市公共艺术空间。",
    "description_en": "aaajiao (Xu Wenkai) is a media artist and a media and internet activist. He created his new work by visualizing Chinese mainstream news portals wireframe from 1999 to 2016. This work is expressed as a digital landscape of banners that give physical form to the work's abstract description. Ultimately, this work expresses objection to the consumption of information occurring in today’s ‘digital world’, a form of ‘cheap and useless’ consumption that does not create anything meaningful. aaajiao makes data structure into changing comparative digital forms or ‘banners’ to investigate whether people change through consuming and digesting information in this age where information data and daily life are binding ever more closely. The title of this work, like a code name of an organization or operation, sounds like a code command, concealing its double intent. This project was first presented at REFORMERart city public art space on Hunan Road.",
    "video_link": "",
    "size": "",
    "duration": "",
    "tags": []
  },
  {
    "url": "https://eventstructure.com/Patience-for-the-man",
    "title": "Patience for the man",
    "title_cn": "",
    "type": "Performance",
    "materials": "Concept by: aaajiao, B6, Stephania Rossetti, Alizia Borsari; Sound by: B6; Computer Graphics by: aaajiao; Dancer: Stephania Rossetti; Actress: Alizia Borsari",
    "year": "2009",
    "description_cn": "",
    "description_en": "A performance exploring patience through collaborative choreography and multimedia.",
    "video_link": "",
    "size": "",
    "duration": "",
    "tags": []
  },
  {
    "url": "https://eventstructure.com/Patience-for-the-man-1",
    "title": "Patience for the man",
    "title_cn": "",
    "type": "Performance",
    "materials": "",
    "year": "2008",
    "description_cn": "",
    "description_en": "Concept: aaajiao, B6, nunu, linxi.\nSound: B6.\nArchitecture: Wang Zhenfei, Wang Luming.\nComputer graphics: aaajiao.\nDancer: nunu, linxi.\nActress: Alizia Borsari.\nSupport by arthub, eArts.\nCurated by Defne Ayas and Davide Quadrio.",
    "video_link": "",
    "size": "",
    "duration": "",
    "tags": []
  },
  {
    "url": "https://eventstructure.com/Poor-Mining-I",
    "title": "Poor Mining I",
    "title_cn": "",
    "type": "Installation",
    "materials": "computer components, speakers, metal material, PMMA",
    "year": "2011",
    "description_cn": "",
    "description_en": "Mining for Bitcoin, size 65cm × 40cm × 47cm.",
    "video_link": "",
    "size": "",
    "duration": "",
    "tags": []
  },
  {
    "url": "https://eventstructure.com/Pinky-Swear",
    "title": "Pinky Swear",
    "title_cn": "小拇指发誓",
    "type": "Exhibition",
    "materials": "Various installations and moving image works",
    "year": "2025",
    "description_cn": "Tabula Rasa 画廊很高兴地呈现 aaajiao 的个展“小拇指发誓”，将于 2025 年 10 月 13 日开幕。此次展览展示了新安装和动态影像作品，探讨孤独、民族主义和数字文化的回音室等主题。它集中在简体中文互联网中的“网络民族主义”概念，并调查算法治理驱动的情感和政治生态。",
    "description_en": "Tabula Rasa Gallery is pleased to present “Pinky Swear,” a solo exhibition by aaajiao, opening 13 October 2025. This exhibition features new installations and moving image works that examine themes of loneliness, nationalism, and the echo chambers of digital culture. It centers on the concept of “cyber-nationalism” across the Simplified Chinese internet and investigates the emotional and political ecology driven by algorithmic governance.",
    "video_link": "",
    "size": "",
    "duration": "",
    "tags": []
  },
  {
    "url": "https://eventstructure.com/Progress-Bar",
    "title": "Progress Bar",
    "title_cn": "进度条",
    "type": "Video",
    "materials": "Single channel video, color, sound; screen / 单频彩色有声录像、屏幕",
    "year": "2017",
    "description_cn": "作品是与张弢和声音艺术家谭硕欣共同完成。",
    "description_en": "A collaboration with Mog and sound artist Tan Shuoxin.",
    "video_link": "https://player.vimeo.com/video/270373267",
    "size": "",
    "duration": "",
    "tags": []
  },
  {
    "url": "https://eventstructure.com/Prompt-Engineering",
    "title": "Prompt / 视频",
    "title_cn": "Prompt",
    "type": "Video",
    "materials": "Variable dimensions / 尺寸可变",
    "year": "2023",
    "description_cn": "《咒文》由阿角创作，展示了生成AI过程与社会结构的交集，深刻反映了技术在塑造身份和认知中的角色。",
    "description_en": "Prompt from aaajiao on Vimeo. The work encapsulates the intersection between generative AI processes and societal constructs, presenting a deep reflection on technology's role in shaping identity and perception.",
    "video_link": "https://vimeo.com/1723048200",
    "size": "",
    "duration": "",
    "tags": []
  },
  {
    "url": "https://eventstructure.com/Prophecy-nullification-algorithm-shaman-conspiracy",
    "title": "Prophecy, nullification algorithm, shaman, conspiracy",
    "title_cn": "预言，失效算法，萨满，阴谋",
    "type": "Video installation",
    "materials": "LCD screen, acrylic fittings",
    "year": "2021",
    "description_cn": "",
    "description_en": "A video installation exploring themes of prophecy and conspiracy through a nullification algorithm.",
    "video_link": "",
    "size": "",
    "duration": "",
    "tags": []
  },
  {
    "url": "https://eventstructure.com/Pure",
    "title": "Pure",
    "title_cn": "纯粹",
    "type": "installation, app",
    "materials": "size 280cm × 102cm × 30cm",
    "year": "2013",
    "description_cn": "RGB 三原色构建了这个世界一切动态可视化信息,分离的展示RGB的变化应该是神圣纯粹的。",
    "description_en": "RGB colour build this world with all dynamic visual information, separating RGB display changes should be purely sacred.",
    "video_link": "",
    "size": "",
    "duration": "",
    "tags": []
  },
  {
    "url": "https://eventstructure.com/RealPacman",
    "title": "RealPacman",
    "title_cn": "",
    "type": "Interactive Installation",
    "materials": "Unknown",
    "year": "2007",
    "description_cn": "",
    "description_en": "An interactive installation for the e-Arts Festival in Shanghai, featuring contributions from aaajiao and others.",
    "video_link": "",
    "size": "",
    "duration": "",
    "tags": []
  },
  {
    "url": "https://eventstructure.com/Remnants-of-an-Electronic-Past",
    "title": "Remnants of an Electronic Past",
    "title_cn": "电子遗留物",
    "type": "Exhibition",
    "materials": "",
    "year": "2016",
    "description_cn": "\"电子遗留物\"是上海艺术家aaajiao (徐文恺)在OCAT西安馆举办的个展，展示了一系列为此次展览特别委托的新作品。展览从2016年6月18日持续至9月11日，也是aaajiao在多个美术馆个展和群展中的第一场，探讨了随着科技发展过时软件的命运。项目反映了传统知识与现代技术媒体之间的关系，涉及消费与对不断变化的科技的怀旧情感。",
    "description_en": "\"Remnants of an Electronic Past\", a museum solo exhibition of Shanghai-based artist aaajiao (Xu Wenkai) at OCAT Xi’an, featuring a body of new works commissioned for the show. Opening June 18 and running through September 11th, 2016, this exhibition marks the first in a series of institutional solo exhibitions and museum group shows for aaajiao, exploring the fate of outdated software amid advancing technology. The project reflects on the relationship between traditional knowledge and contemporary technological media, touching on themes of consumption and nostalgia towards the nature of evolving technologies.",
    "video_link": "https://player.vimeo.com/video/172704243",
    "size": "",
    "duration": "",
    "tags": []
  },
  {
    "url": "https://eventstructure.com/Remnants-of-an-Electronic-Past-CFCCA",
    "title": "Remnants of an Electronic Past",
    "title_cn": "",
    "type": "Exhibition",
    "materials": "Plastic panels, digital technology, video",
    "year": "2016",
    "description_cn": "",
    "description_en": "To celebrate Manchester's position as European City of Science 2016, Centre for Chinese Contemporary Art (CFCCA) presents the first UK solo exhibition by Shanghai based new-media artist, aaajiao. The exhibition explores the history of Windows Operating Systems and our relationship with digital technologies through immersive installations.",
    "video_link": "",
    "size": "",
    "duration": "",
    "tags": []
  },
  {
    "url": "https://eventstructure.com/Repeatedly",
    "title": "Repeatedly",
    "title_cn": "反复",
    "type": "Installation",
    "materials": "GIF",
    "year": "2013",
    "description_cn": "用非常小的一张gif构造一块深度无限的空间。.gif是我们常见的一种格式,她的特点是通过反复释放信息,但也是这样的反复,让她变的如此狡猾,极富性格。",
    "description_en": "GIF is a common format which is characterised by the repetition of information. With one small GIF, an infinite depth of space is constructed, but it is also cunning and tremendously characteristic.",
    "video_link": "",
    "size": "",
    "duration": "",
    "tags": []
  },
  {
    "url": "https://eventstructure.com/Seed-1348845846-1279984655",
    "title": "Seed 1348845846",
    "title_cn": "种子 1348845846",
    "type": "Digital Printing",
    "materials": "Digital printing, manual silk screening, hand drawing on linen",
    "year": "2023",
    "description_cn": "",
    "description_en": "This artwork combines various elements capturing the essence of an internet data center alongside traditional Thangka art from Tibet. It explores the intersection of contemporary technology, historical art forms, and the complexities of communication through vibrant imagery, detailed wireframes, and abstract representations of nature and architecture.",
    "video_link": "https://s.mj.run/dLVwz-LkxGo",
    "size": "",
    "duration": "",
    "tags": []
  },
  {
    "url": "https://eventstructure.com/Seed-3339138223-3632602548",
    "title": "Seed: 3339138223",
    "title_cn": "种子: 3339138223",
    "type": "Digital Printing",
    "materials": "Digital printing, manual silk screening, hand drawing on linen",
    "year": "2023",
    "description_cn": "",
    "description_en": "A ghost rover of a secondary girl in Cyberspace, vintage camera, dreamy, fantasy concept art inspired by artists like Tony DiTerlizzi and Alphonse Mucha, dimensions 200cm x 200cm.",
    "video_link": "",
    "size": "",
    "duration": "",
    "tags": []
  },
  {
    "url": "https://eventstructure.com/Seed-3864673680-2020419678-861016247",
    "title": "Seed",
    "title_cn": "种子",
    "type": "Digital Printing / 数字印刷",
    "materials": "Digital printing, manual silk screening, hand drawing on linen / 数字印刷，手工丝网印刷，亚麻手绘",
    "year": "2023",
    "description_cn": "",
    "description_en": "A ghost rover of a secondary girl in Cyberspace, surrounded by faint columnasts and craters while posing for a photo, extreme close-up, somber, red-fabric, black-skin, white ribbons, trending on ArtStation, 8K, highly detailed, wide-angle lens, stunning volumetric lighting, dark moody atmosphere, cinematic lighting.",
    "video_link": "",
    "size": "",
    "duration": "",
    "tags": []
  },
  {
    "url": "https://eventstructure.com/Simulate-Simulator",
    "title": "Simulate Simulator",
    "title_cn": "模拟模拟器",
    "type": "Fiction",
    "materials": "",
    "year": "2020",
    "description_cn": "Ag，漫游的写作者，1985年生于上海。工作涉及短篇小说、评论、策展与电影。《模拟模拟器》是Ag受aaajiao邀请，由展览“Cave simulator / 洞穴模拟器” 为借口的短篇小说。",
    "description_en": "Ag, the roaming writer, was born in Shanghai in 1985. Work involves short stories, reviews, curation and film. _Simulate Simulator_ is a short story by Ag invited by aaajiao under the pretext of the exhibition _Cave Simulator._",
    "video_link": "",
    "size": "",
    "duration": "",
    "tags": []
  },
  {
    "url": "https://eventstructure.com/Siu",
    "title": "Siu~",
    "title_cn": "装置",
    "type": "Installation",
    "materials": "Cellophane, UV printing / 玻璃纸，UV打印",
    "year": "2021",
    "description_cn": "延续了之前《橡皮软糖》使用的玻璃糖纸材料，UV在材料上，涂层脆弱，揉搓材料并再次铺展开，涂层会龟裂，掉落，图片的内容是LED透过玻璃映射在玻璃正面的云层的倒影中，在此刻看见了所有可被眼睛看到的光，下一刻消散破碎，念头般不值一提。",
    "description_en": "Continued the material selection in the previous gumdrop, Siu~ also uses cellphone and UV printing. The coating is fragile. After kneading the material and spreading it again, the coating will crack and fall off. The image's content reflects the clouds mapped by LED through the front of the glass. All the light that the eye can receive at this moment is dissipated and shattered in the next instant, just as worthless as one's thought.",
    "video_link": "",
    "size": "",
    "duration": "",
    "tags": []
  },
  {
    "url": "https://eventstructure.com/Soft",
    "title": "Soft",
    "title_cn": "柔软",
    "type": "Installation",
    "materials": "Size 280cm × 102cm × 30cm",
    "year": "2013",
    "description_cn": "蓝色的屏幕,犹如一道通往新纬度的大門,蓝色中运动的影子,是对日常在使用屏幕中看到现实中影子的一种抽象化处理,这样的结构让我们无法判断现实和虚拟的界限,最终放弃分辨融入其中。",
    "description_en": "With a blue screen acting as if it is a door leading to a new latitude, the blue moving shadow becomes an abstracted processing of a real screen. This structure blurs the boundaries between the 'real' and 'virtual', confusing the ability to distinguish between realities. This allows for complete immersion.",
    "video_link": "",
    "size": "",
    "duration": "",
    "tags": []
  },
  {
    "url": "https://eventstructure.com/SoundEmbedded",
    "title": "Mixer Installation for Virtual City",
    "title_cn": "",
    "type": "Installation",
    "materials": "concept: aaajiao, B6; sound: B6; hardwave: aaajiao, majian",
    "year": "2008",
    "description_cn": "",
    "description_en": "A sound installation featured in the New Power – China Contemporary Art Biennale 2008, created by aaajiao.",
    "video_link": "",
    "size": "",
    "duration": "",
    "tags": []
  },
  {
    "url": "https://eventstructure.com/Space",
    "title": "Space",
    "title_cn": "空间",
    "type": "video installation, website",
    "materials": "10' LED screen (custom can play video directly) x1 / 10 寸 LED 屏幕 -7'26''",
    "year": "2016",
    "description_cn": "当网站死去。作品是与圈圈共同完成。",
    "description_en": "When a website to die. This piece was done in collaboration with Quanquan.",
    "video_link": "https://t-h-e-s-p-a-c-e.com/space/",
    "size": "",
    "duration": "",
    "tags": []
  },
  {
    "url": "https://eventstructure.com/Squab",
    "title": "Squab",
    "title_cn": "乳鸽",
    "type": "Installation",
    "materials": "Squab model, camera, metal acrylic structure / 乳鸽模型，摄像头，金属亚克力结构",
    "year": "2024 - 2025",
    "description_cn": "许多公共户外摄像头为防止鸽子停歇和排泄，会安装特制的金属防鸟刺。作品借用这一日常装置，并将一只乳鸽模型“扎”在刺上。乳鸽在华语文化中是一种常见且受欢迎的食材，常见于粤菜与港式料理，被视为高蛋白、低脂的理想选择；对移民而言，乳鸽与诸多原乡食物一样，承载维系语言与社群的纽带，唤起有关“家”的熟悉感，缓解孤独与疏离。然而，当“乳鸽”作为食物的现实，与“鸽子”在更广泛语境中象征和平与洁净的意象相遇时，关于文化身份的隔阂与偏见也随之浮现。",
    "description_en": "To keep pigeons from perching and fouling, outdoor surveillance cameras are often fitted with metal anti-bird spikes. This work appropriates that familiar hardware, “impaling” a squab model on the prongs. In Sinitic cuisines, squab is a prized staple—especially in Cantonese and Hong Kong dishes—valued as high-protein and low-fat. For migrants, like many foods of home, it binds language and community, conjuring a sense of “home” that softens loneliness and estrangement. Yet when squab-as-food meets the wider emblem of the pigeon as purity and peace, the rifts and biases around cultural identity come into view.",
    "video_link": "",
    "size": "",
    "duration": "",
    "tags": []
  },
  {
    "url": "https://eventstructure.com/Sunbathing-Not-dead",
    "title": "Sunbathing? Not dead.",
    "title_cn": "晒太阳呢，没死",
    "type": "Installation",
    "materials": "3D resin printing, hand-painted",
    "year": "2024 - 2025",
    "description_cn": "一张在互联网上流传的新闻照片迷因，画面中一位女孩躺在乡村商店街的台阶上，用A4纸盖住头，纸上写着：“晒太阳呢，没死，谢谢关心。”艺术家借助AI平台的算法，将照片中的人物转化为三维模型，并通过3D打印与手工上色重现这一场景。然而，算法并不能细腻地还原人物的具体形态，模型因而呈现出一种看似随机却仍可辨识的“孤独”形状。",
    "description_en": "Based on a widely shared news photo: a girl lies on the steps of a village storefront, an A4 sheet over her face that reads, “Sunbathing, not dead, thanks for your concern.” The artist used an AI platform to convert the figure into a 3D model, then re-staged the scene via 3D printing and hand painting. The algorithm cannot recover precise physiognomy; the result is a form that feels arbitrary yet legible, a shape of “loneliness.”",
    "video_link": "",
    "size": "",
    "duration": "",
    "tags": []
  },
  {
    "url": "https://eventstructure.com/Tennis-for-none",
    "title": "Tennis for none",
    "title_cn": "无人网球",
    "type": "video, app, website",
    "materials": "-A small projection (custom can play video directly) x1 / 投影 -9'01''",
    "year": "2016",
    "description_cn": "Tennis for Two (1958) 是最早的一款电子游戏,而 Tennis for none 是 一款《电子遗留物》游戏。",
    "description_en": "Tennis for Two (1958) is the earliest a video game, Tennis for none but a Remnants of an Electronic Past game.",
    "video_link": "https://t-h-e-s-p-a-c-e.com/tennis-for-none",
    "size": "",
    "duration": "",
    "tags": []
  },
  {
    "url": "https://eventstructure.com/Text-Format",
    "title": "Placebo",
    "title_cn": "徐文恺个展",
    "type": "digital printing",
    "materials": "digital printing, bracket",
    "year": "2011",
    "description_cn": "",
    "description_en": "A solo exhibition featuring works that explore the theme of placebo effects through various digital print mediums.",
    "video_link": "",
    "size": "",
    "duration": "",
    "tags": []
  },
  {
    "url": "https://eventstructure.com/Text-Format-II",
    "title": "Text Format II",
    "title_cn": "",
    "type": "digital printing",
    "materials": "bracket",
    "year": "2012",
    "description_cn": "",
    "description_en": "Numerous format conversion error image, size 160cm × 68cm.",
    "video_link": "",
    "size": "",
    "duration": "",
    "tags": []
  },
  {
    "url": "https://eventstructure.com/The-Screen-Generation",
    "title": "The Screen Generation",
    "title_cn": "屏幕一代",
    "type": "Exhibition",
    "materials": "Flat screen, digital applications",
    "year": "2013-2014",
    "description_cn": "chi K11艺术空间荣幸地带来本年度的压轴展览，艺术家aaajiao（徐文恺）个展《屏幕一代》。作为K11 Art Foundation大力扶持的中国前沿媒体艺术家，aaajiao的作品专注于对数据的挖掘与实用，并试图以多种形式将其呈现，以此在数据与现实的“调制解调”中完成对作品内涵的完整表达。本次展览将呈现aaajiao的6件新作，展览将于2013年12月14日开幕，展至2014年2月15日。展览中将探讨科技如何使用自身进行自我呈现，以及这对于人类感知和理解的影响。",
    "description_en": "chi K11 Art Space is pleased to present The Screen Generation, solo exhibition of artist aaajiao (Xu Wenkai) and also the finale exhibition of 2013 at the space. As one of the young generation artists sponsored by K11 Art Foundation, aaajiao is a leading new media artist in China. His work features exploration and application of data in various forms, endeavoring to present a full picture of his practice and his thought behind it through the modulation/demodulation of data and reality. Known for his ingenious and innovative experiment in integrating computer software with art, in this upcoming solo exhibition, aaajiao will be presenting six of his latest works. Different from the artist’s previous solo exhibitions which showcased logical enquiries and research on data itself, The Screen Generation will share with the audience a more personal experience. The exhibition will open to public on December 14, 2013 and run through February 15, 2014. In the meantime, a series of public education events and seminars will be held during the exhibition at both chi K11 Art Space and Minsheng Art Museum. The six pieces that make up The Screen Generation are Soft, Repeatedly, Hard, Pure, Static, and Noise, which all exist and begin as digital applications developed by the artist. The display medium used in The Screen Generation is flat screen. According to the artist, as a generation who have long been surrounded by information technology, 'we' have gradually become information nodes. The screens in this exhibition serve as containers and frames for the interactions between the audience and the digital applications, emphasizing the human-oriented nature of the artworks.",
    "video_link": "https://player.vimeo.com/video/88982072",
    "size": "",
    "duration": "",
    "tags": []
  },
  {
    "url": "https://eventstructure.com/The-Screen-Generation-Prequel-catalog",
    "title": "The Screen Generation: Prequel",
    "title_cn": "屏幕一代：前传",
    "type": "Exhibition",
    "materials": "",
    "year": "2013",
    "description_cn": "新媒体艺术家aaajiao在北京 C－空间 的个展《屏幕一代：前传》中将呈现六件新的作品，区别于艺术家之前的两次关于对数据本身理性研究的个展，这一次的呈现将会是一次柔软的体验。作品分别为“柔软”、“反复”、“坚硬”、“纯粹”、“静止”和“闹”，它们都存在和源自艺术家开发的电子应用程序。",
    "description_en": "In new media artist aaajiao’s upcoming solo exhibition at C-Space, The Screen Generation: Prequel, the artist will be presenting six of his newest works. While differing from the artist’s previous solo exhibitions which showcased logical enquiries and research on data itself, this presentation will be a more personal experience for the audience. The six pieces that make up The Screen Generation are Soft, Repeatedly, Hard, Pure, Static, and Noise, the artworks all exist and begin as digital applications developed by the artist.",
    "video_link": "",
    "size": "",
    "duration": "",
    "tags": []
  },
  {
    "url": "https://eventstructure.com/The-Screen-Generation-9m-Museum",
    "title": "The Screen Generation",
    "title_cn": "屏幕一代",
    "type": "Installation",
    "materials": "visual: xu cong, sound: nara",
    "year": "2014",
    "description_cn": "《屏幕一代》@9平米美术馆是《屏幕一代》系列作品在美学探索上的一次小结。与前两次的展览比较而言，《屏幕一代@9平米美术馆》将屏幕与人的相互关系阐述得更加情绪明确。在《屏幕一代》系列作品中，艺术家最初为观众提出了两个命题，一是应用程序生成数据，转换成屏幕上的图像和声音，通过不断的自我展示，带给人类感官与情感的体验。另外一个命题讨论早已被信息化的“我们”逐渐变成信息的节点，使用屏幕的同时也成为屏幕本身，从而与屏幕彼此构成生态系统的现状。本次作品避开了新媒体艺术中容易让人产生理解偏差的“拟人”和“拟物”的观点，将屏幕与人，即科技与人类相互关系的大命题巧妙地落在一件细微之物——首饰上。一贯冷静理性的视觉形象，结晶糖块的味觉体验，吮咬糖块和反复拨弄磁球的心理暗示，心理暗示造成的强迫性的精神反应与行为结果，通过首饰与人肌肤相亲这一个简单的联结，《屏幕一代@9平米美术馆》将屏幕与人的平等、共生和共同发展的社会关系举重若轻地铺展开来。",
    "description_en": "The Screen Generation @ 9m²-Museum can be seen as a summary of the aesthetic exploration made by the Screen Generation Series. Compared with the previous two presentations, The Screen Generation @ 9m²-Museum addresses the interactive relation between man and screen in a more direct and clearer way. In the Screen Generation Series, the artist raises two propositions. The first is to transform application-generated data into images and sounds on screen and to give people sensual and emotional experience through constant presentation. The other is that as a generation having long been surrounded by information technology, 'we' have gradually become information nodes. In other words, as digital screen users, we have been developed into a screen generation where we become the screen itself. Aaajiao’s work aptly evades concepts such as 'personification' and 'objectification' that would easily cause confusion and misunderstanding of new media art. In this piece, a complex issue as the interplay between man and screen, or say between man and technology, is skillfully encapsulated in something as subtle as a piece of jewelry. The wearing of these jewelry pieces epitomizes a connection between man and screen. By combining visual images (which are cool and rational as always), sense of taste (of the sugar crystals), psychological hint (given by the action of licking and fondling), and compulsion (on both physical and mental levels), Screen Generation @ 9m² -Museum manages to cast light on equality, co-existence and co-development of the relation between screen and man in a humorous way.",
    "video_link": "https://player.vimeo.com/video/88977098",
    "size": "",
    "duration": "",
    "tags": []
  },
  {
    "url": "https://eventstructure.com/Time-Refactoring",
    "title": "Time Refactoring",
    "title_cn": "",
    "type": "video",
    "materials": "projection mapping",
    "year": "2012",
    "description_cn": "表现主义思潮经历了一整个世纪的变迁，与上海美术馆一个世纪以来的变迁一样，经由时间的洗练，历久弥新。影像抓住‘时间’这一线索，试图用一种重新构建的手法，去展现这一变化，通过对上海美术馆外立面的立体投影，采取描边、勾线、扭曲变形、表面重建、波形震荡、轴向层级展开等蒙太奇手法，将展览作品的变迁，用影像的方式重新再现。碎片化的叙述结构和对时间轴非线性整理，使时间的概念得以重构。",
    "description_en": "Projection mapping for Shanghai Art Museum revealing the evolution of expressionism across a century. The work showcases the transformation through various montage techniques, employing outline and distortion effects on the museum's exterior to depict changes in the exhibited artwork, reconstructing the concept of time with a fragmented narrative structure.",
    "video_link": "https://player.vimeo.com/video/56334166",
    "size": "",
    "duration": "",
    "tags": []
  },
  {
    "url": "https://eventstructure.com/Trfinite-I",
    "title": "Trfinite I",
    "title_cn": "",
    "type": "permanent installation",
    "materials": "video",
    "year": "2013",
    "description_cn": "徐文恺的机器风景，可以被看作媒体艺术领域在自然融合方面的贡献，其中包含来自分形理论的因素，算法构建的机械装置，如同海浪或生物。艺术家为虚拟模拟和算法进行了物理性延伸，作品的镜面和实际发生的运动所构成的图像，将与观众互动，形成一个不断变化和蔓延的空间。艺术家徐文恺的作品简单直接作用于艺术与科技，并延续他之前作品一贯的科技悖论之线索。——李振华",
    "description_en": "The Robotic Landscape of aaajiao serves as media art’s contribution to our integration with nature. The work is a mechanical installation that operates on fractal algorithms. The organic or wave-like structure of the work can be seen as the physical extension of a virtual simulation and algorithms. The image created by the reflective surface of the robot as it assumes motion generates points of interaction with the audience, forming an ever changing and expanding space. aaajiao’s work acts directly on art and technology, and has persistently engaged various paradoxes within the development of science. －Li Zhenhua",
    "video_link": "https://vimeo.com/68586747",
    "size": "",
    "duration": "",
    "tags": []
  },
  {
    "url": "https://eventstructure.com/Trfinite-II",
    "title": "Trfinite II",
    "title_cn": "",
    "type": "installation",
    "materials": "size 480cm × 120cm × 60cm",
    "year": "2013",
    "description_cn": "徐文恺的机器风景，可以被看作媒体艺术领域在自然融合方面的贡献，其中包含来自分形理论的因素，算法构建的机械装置，如同海浪或生物。艺术家为虚拟模拟和算法进行了物理性延伸，作品的镜面和实际发生的运动所构成的图像，将与观众互动，形成一个不断变化和蔓延的空间。艺术家徐文恺的作品简单直接作用于艺术与科技，并延续他之前作品一贯的科技悖论之线索。——李振华",
    "description_en": "The Robotic Landscape of aaajiao serves as media art’s contribution to our integration with nature. The work is a mechanical installation that operates on fractal algorithms. The organic or wave-like structure of the work can be seen as the physical extension of a virtual simulation and algorithms. The image created by the reflective surface of the robot as it assumes motion generates points of interaction with the audience, forming an ever changing and expanding space. aaajiao’s work acts directly on art and technology, and has persistently engaged various paradoxes within the development of science. －Li Zhenhua",
    "video_link": "",
    "size": "",
    "duration": "",
    "tags": []
  },
  {
    "url": "https://eventstructure.com/Turritopsis-nutricula",
    "title": "Turritopsis nutricula",
    "title_cn": "Turritopsis nutricula",
    "type": "Computer Generated Moving Image installation",
    "materials": "algorithm generated Turritopsis nutricula, computer graphics : aaajiao, liu xiaoguang",
    "year": "2010",
    "description_cn": "",
    "description_en": "First discovered in the Mediterranean in 1883, the Turritopsis Nutricula is a hydrozoan, whose Medusa (jellyfish) is effectively immortal. When threatened, the Medusa’s cells can age backwards from sexual maturity to those halcyon days of jellyfish childhood. From there, they age again, then regress again, ad infinitum. This happens through a process called transdifferentiation, in which one type of cell switches to another type. For this piece, aaajiao created an algorithmically generated swarm of these creatures. As the pixelated bloom floats by, one thinks about how the digital age confounds the linear march of time. The two poles of Turritopis‘s existence–youth and sexual maturity–find parallel in our division between the virtual world and the physical.",
    "video_link": "",
    "size": "",
    "duration": "",
    "tags": []
  },
  {
    "url": "https://eventstructure.com/URLis-LOVE",
    "title": "URL is LOVE - 2020 URL is LOVE - A Digital Retrospective",
    "title_cn": "URL是爱 - 2020 URL是爱 - 数字回顾展",
    "type": "Exhibition",
    "materials": "N/A",
    "year": "2020",
    "description_cn": "Tabula Rasa画廊荣幸地宣布将于2020年8月1日起呈现艺术家aaajiao的数字作品回顾展“2020 URL是爱 - 数字回顾展”。这是Tabula Rasa画廊与aaajiao合作的首次在线个展，展出aaajiao从2008年到2020年利用互联网作为创作媒介的最具代表性的作品，探讨数字时代身份和自由的主题。",
    "description_en": "Tabula Rasa Gallery is pleased to present artist aaajiao’s online retrospective '2020 URL is LOVE - A Digital Retrospective' from August 1st, 2020. This exhibition marks the first solo exhibition collaboration between Tabula Rasa Gallery and aaajiao, showcasing works that employed Internet as medium from 2008 to 2020. It represents a history of technology use by a Chinese millennial artist/netizen, emphasizing the nature of the Internet and the impact of virtual artworks. Inspired by Tim Berners-Lee's vision for the World Wide Web, it explores themes of identity and freedom in the digital age.",
    "video_link": "https://urlis.love/",
    "size": "",
    "duration": "",
    "tags": []
  },
  {
    "url": "https://eventstructure.com/Untitled",
    "title": "Untitled",
    "title_cn": "",
    "type": "Video Installation",
    "materials": "LCD screen, acrylic fittings",
    "year": "2015",
    "description_cn": "这是一件以LCD屏幕和压克力组件为特征的视频装置，尺寸为16 x 24 x 3.4cm。视频持续4分钟。这件作品是与许聪共同完成的。",
    "description_en": "A video installation featuring an LCD screen and acrylic fittings, measuring 16 x 24 x 3.4cm. The duration of the video is 4 minutes. This work was made possible in collaboration with Xu Cong.",
    "video_link": "",
    "size": "",
    "duration": "",
    "tags": []
  },
  {
    "url": "https://eventstructure.com/Two-rituals",
    "title": "Two rituals",
    "title_cn": "两个仪式",
    "type": "video",
    "materials": "Dimension variable",
    "year": "2025",
    "description_cn": "这件作品由三部分素材拼合而成：使用孙三通的神调《哭烟魂》、Ag祖传自奶奶的地藏仪轨行为视频- Ksitigarbha，以及宫泽发布于朋友圈的生活片段，最终被重新剪辑成单一的视频。其叙事线索来自宫泽讲述的东北（哈尔滨）同辈从俱乐部文化到直播带货再到转入“出马仙”式的“心理咨询/安抚”角色的转变，并由Ag以地藏信仰与“废墟—中阴（bardo）”的城市感受为精神框架将三者串联。作品的叙事线索来自宫泽对东北（哈尔滨）同辈的一段代际轨迹的讲述：从少年混迹俱乐部、进入club工作，转向直播带货，再在经济转折后进入“出马仙”体系，以“看事/安抚”的方式承担某种“心理咨询”角色。这一路径与简中互联网及社会舆论的阶段性变迁同频，呈现“民间灵性—平台经济—代际生计”的流变，并在语义上将“心理医生式”的社会角色与《哭烟魂》的劝解功能对位。Ag的行动框架来自江南关于地藏的民间供养仪轨“插棒香（插地香）”——既是家族传承，也是其介入城市现场的方法论。2016年，Ag曾在普陀“七家村”旧址公开完成相关仪式。Ag对上海的整体感知是“中阴（bardo）/幻觉之城”：将中心的褶皱、地下与边缘与高耸光鲜视为同一连续体，并以“废墟—中阴—愿力”的转换逻辑来塑造角色与场景。定海桥动迁后的“暂时性废墟”成为拍摄起点，并与地藏诞辰日完成的插香仪轨相互嵌合，指向一种“在混凝土中寻找泥土缝隙”的身体化观看方式。后疫情时期的无人驾驶地铁与“幽灵列车”意象呼应“无头无尾的电影”，与“在黑暗中看得更清”的清眼动作构成隐喻链条，支撑“中阴在废墟中”的影像语感。最终成片以《哭烟魂》铺陈声场，Ag的废墟身体表演执掌视觉叙事，朋友圈的日常影像作为现实的刺点插入。此种并置让民间信仰、当代城市经验与平台化生活同时发生，构筑出“愿力穿行中阴”的观看机制与叙事框架。",
    "description_en": "Three strands are braided into a single cut: Sun Santo’s sacred tune Crying Smoke-Soul; Ag’s ritual performance of Ksitigarbha inherited from his grandmother; and everyday clips Gongze posted to his friend circle. The narrative takes its cue from Gongze’s account of peers in Harbin: drifting through club culture, turning to livestream commerce, then—amid economic shifts—entering the “chuma xian” spirit-medium system to “see/soothe,” a role akin to informal counseling. Ag threads these with a framework of Ksitigarbha devotion and an urban sensorium of “ruin—bardo.” The trajectory mirrors phases of the Simplified-Chinese internet and public discourse, charting the currents of “folk spirituality—platform economy—generational livelihood,” and placing the consolatory function of Crying Smoke-Soul in counterpoint to a social role likened to a “psychiatrist.” Ag’s method draws on a Jiangnan rite for Ksitigarbha—“inserting stick incense” into the earth—both a family lineage and a way to intervene on site. In 2016, Ag enacted it at the former “Qijia Village” in Putuo. Shanghai, in Ag’s grasp, is a “bardo/illusory city”: center and fold, underground and edge, gleam and height as a single continuum, where roles and scenes turn on the axis “ruin—bardo—vow-power.” The “temporary ruins” left by the Dinghai Bridge relocation anchor the shoot and interlock with an incense rite on Ksitigarbha’s birthday, proposing a bodily way of seeing that “finds soil’s seams in concrete.” In the post-pandemic city, driverless metros and the “ghost train” rhyme with a “headless, tailless film,” linking to a clear-eyed practice of “seeing better in the dark”—a chain of metaphors that gives the image its “bardo-in-ruins” cadence. The finished edit lays its sound bed with Crying Smoke-Soul; Ag’s ruin-body performance steers the image; and friend-circle clips puncture the surface as reality’s burrs. Folk belief, urban experience, and platformed life are made concurrent, elaborating a viewing mode and narrative in which “vow-power moves through the bardo.”",
    "video_link": "https://vimeo.com/1108889225",
    "size": "",
    "duration": "",
    "tags": []
  },
  {
    "url": "https://eventstructure.com/Untitled-0",
    "title": "Untitled",
    "title_cn": "",
    "type": "Video Installation",
    "materials": "LCD screen, acrylic fittings",
    "year": "2015",
    "description_cn": "作品是与许聪完成。",
    "description_en": "made possible with the collaboration of Xu Cong.",
    "video_link": "",
    "size": "",
    "duration": "",
    "tags": []
  },
  {
    "url": "https://eventstructure.com/Untitled-1",
    "title": "Untitled",
    "title_cn": "无题",
    "type": "Video Installation",
    "materials": "LCD screen, acrylic fittings / LCD显示器，压克力组件",
    "year": "2015",
    "description_cn": "作品是与张弢完成。",
    "description_en": "A video installation piece made possible with the collaboration of Mog.",
    "video_link": "",
    "size": "",
    "duration": "",
    "tags": []
  },
  {
    "url": "https://eventstructure.com/Untitled-2",
    "title": "Untitled",
    "title_cn": "",
    "type": "Video Installation",
    "materials": "LCD screen, acrylic fittings ／ LCD显示器，压克力组件",
    "year": "2015",
    "description_cn": "一件视频装置，包含LCD显示器和压克力组件，尺寸为16 x 24 x 3.4 cm，时长4分钟。作品是与张弢完成。",
    "description_en": "A video installation featuring LCD screen and acrylic fittings, measuring 16 x 24 x 3.4 cm, with a duration of 4 minutes. Made possible with the collaboration of Mog.",
    "video_link": "",
    "size": "",
    "duration": "",
    "tags": []
  },
  {
    "url": "https://eventstructure.com/Unzip",
    "title": "Unzip",
    "title_cn": "",
    "type": "Software",
    "materials": "ZIP file",
    "year": "2023",
    "description_cn": "",
    "description_en": "aaajiao’s “Unzip” is a 88 zip sub-package file. Each zip is an NFT. If the collector wishes to unzip the sub-package, they must collect all of the 88 zip sub-packages. Is it possible that an NFT, which creates value out of trading, may also inspire curiosity and solidarity through trading?",
    "video_link": "",
    "size": "",
    "duration": "",
    "tags": []
  },
  {
    "url": "https://eventstructure.com/User-Love-High-frequency-Trading",
    "title": "User, Love, High-frequency Trading",
    "title_cn": "用户、爱、高频交易",
    "type": "Exhibition",
    "materials": "Video Installation, pixelated GIF animation, programmed hourglass, kinetic installation",
    "year": "2017",
    "description_cn": "《用户、爱、高频交易》是新媒体艺术家aaajiao的第二次个展，探讨了数字世界中身份和角色的问题，通过多种装置和视频作品的呈现。展览考察了用户与技术之间的关系，聚焦于社交互动、情感表达和算法与网络的影响。主要作品包括一部探讨现实与联系概念的赛博格视频装置，以及通过水滴视觉化高频交易数据的沙漏。",
    "description_en": "\"User, Love, High-frequency Trading\" is the second solo exhibition by new media artist aaajiao, exploring identities and roles in the digital landscape through multiple installations and video works. The show investigates the relationship between users and technology, focusing on the mechanisms of social interaction, emotional expression, and the effects of algorithms and networking. Key works include a video installation that features cyborgs exploring concepts of reality and connection, and an hourglass that visually interprets high-frequency trading's data through water drips.",
    "video_link": "",
    "size": "",
    "duration": "",
    "tags": []
  },
  {
    "url": "https://eventstructure.com/WELT",
    "title": "WELT",
    "title_cn": "WELT",
    "type": "website",
    "materials": "Decentralized application, Blockchain structure, interactive editing screen",
    "year": "2020",
    "description_cn": "WELT 是一个链接，一个 Dapp，一个真相，探索赛博形象的边界。用户可以编辑像素，结构鼓励创造，同时给予像素创造者价值。这件作品由新时线媒体艺术中心（上海）、那比艺术中心（首尔）、新美术馆 Rhizome（纽约）联合委约创作。",
    "description_en": "WELT is a link, a Dapp, and a truth exploring the boundaries of cyber-identity. Users can edit pixels, and the structure encourages creativity while attributing value to pixel creators. This work was co-commissioned by Chronus Art Center (Shanghai), Art Center Nabi (Seoul), and Rhizome of the New Museum (New York).",
    "video_link": "http://we-link.chronusartcenter.org/",
    "size": "",
    "duration": "",
    "tags": []
  },
  {
    "url": "https://eventstructure.com/WYSIWYG",
    "title": "WYSIWYG",
    "title_cn": "所见即所得",
    "type": "installation",
    "materials": "Pcb, smt placement, metal and PVC accessories / 电路板、贴片机、金属和PVC结构",
    "year": "2017",
    "description_cn": "作品与马健和刘晓光共同完成。",
    "description_en": "A collaboration with Ma juan and Liu Xiaoguang.",
    "video_link": "https://player.vimeo.com/video/226570625",
    "size": "",
    "duration": "",
    "tags": []
  },
  {
    "url": "https://eventstructure.com/Water-Measure-Petroleum",
    "title": "Water Measure - Petroleum",
    "title_cn": "水测·石油",
    "type": "Installation / 装置",
    "materials": "Antipodes glass bottles, BLK water, peristaltic pump structure, metal and acrylic accessories / 绮怡玻璃瓶、BLK水、蠕动泵结构、金属和亚克力配件",
    "year": "2017",
    "description_cn": "装置《水测·石油》将高频交易中的冗余数据转译成了二进制代码，在水瓶中以类似沙漏滴漏的方式进行着冗长且又毫无意义的计算。This piece was done in collaboration with Ma Juan and Shen Jiujiu. / 作品是与马健和沈赳赳共同完成。",
    "description_en": "“Water Measure-Petroleum” is a programmed hourglass filled with petroleum-like pitch-black water. Every drip of water reads the binary coded redundant data filtered from high-frequency trading—a futile gesture of reading useless or meaningless information created within the shortest possible amount time by the largest possible multitude of users and operations.",
    "video_link": "https://player.vimeo.com/video/226574906",
    "size": "",
    "duration": "",
    "tags": []
  },
  {
    "url": "https://eventstructure.com/Water-measure",
    "title": "Water measure",
    "title_cn": "",
    "type": "interactive installation",
    "materials": "wood, iron, peristaltic pump, glass jar",
    "year": "2010",
    "description_cn": "",
    "description_en": "Measuring the volume of the email list of artmailart.com in reality.",
    "video_link": "",
    "size": "",
    "duration": "",
    "tags": []
  },
  {
    "url": "https://eventstructure.com/Waving-Bamboo",
    "title": "Waving Bamboo",
    "title_cn": "",
    "type": "Architecture",
    "materials": "",
    "year": "2008",
    "description_cn": "",
    "description_en": "Waving Bamboo is a self generated structure. A dynamic environment is created by strategically arranging the bamboos and connecting them according to specific algorithms. The various spaces offer people different experiences within a continuous environment. Bamboo is chosen to construct the structure due to its special material characteristics as well as its natural features.",
    "video_link": "",
    "size": "",
    "duration": "",
    "tags": []
  },
  {
    "url": "https://eventstructure.com/Windows-Gravestone",
    "title": "Windows Gravestone",
    "title_cn": "视窗碑林",
    "type": "installation",
    "materials": "metal structure with UV print / 金属结构和 UV 打印",
    "year": "2016",
    "description_cn": "作品是与许聪和沈赳赳共同完成。给视窗系统构建墓碑。",
    "description_en": "This piece was done in collaboration with Xu Cong and Shen jiujiu. Built for OS Windows Graveston.",
    "video_link": "",
    "size": "",
    "duration": "",
    "tags": []
  },
  {
    "url": "https://eventstructure.com/Xindanwei-one-company",
    "title": "Xindanwei: A new way of working",
    "title_cn": "新单位:一种新的工作方式",
    "type": "Webpage",
    "materials": "",
    "year": "2009",
    "description_cn": "新单位是中国最早的协作式工作空间，也是中国最先锋的草根创意社群之一。我们致力于建立协作 Workspace 与创意社区，支持乐于分享与合作的创业者和创新者。",
    "description_en": "Xindanwei is the first and largest multidisciplinary coworking community in China, listed among FastCompany’s \"The World’s Top 10 Most Innovative Companies in China.\" It provides community workspaces that foster creative collaboration and innovation.",
    "video_link": "",
    "size": "",
    "duration": "",
    "tags": []
  },
  {
    "url": "https://eventstructure.com/a-a-a-jiao-an-ID",
    "title": "a'a'a'jiao: an ID",
    "title_cn": "a'a'a'jiao：一个ID",
    "type": "Exhibition",
    "materials": "",
    "year": "2019.04.27 – 2019.7.14",
    "description_cn": "昊美术馆（上海）荣幸地宣布，将于2019年4月27日至2019年7月14日举办aaajiao/徐文恺个展 “a'a'a'jiao：一个ID”。本次展览属于昊美术馆推出的中国青年艺术家HOW NOW系列展览。1989年，万维网在英国科学家蒂姆·伯纳斯·李（Tim Berners-Lee）手中诞生。aaajiao（徐文恺）正是在数字技术与网络连接中成长的一代。三十年之后的今天，人们仍然无法用一个词或者一句话来描述互联网带来的改变。在aaajiao看来，技术带来了更多的可能性，满足了人们更多的欲望，同时也带来新的困局和危机：人们越来越以数字和在线的形式存在，被更紧密和广泛地联系在一起，“独立”、“自由”越来越成为无可理喻的抽象概念。数量难以想象的数据被争夺和控制，技术的空前强大和渗透使强权的宰治变得便捷，人们越来越面临爱德华·威尔逊（Edward O. Wilson）描述的“真社会生物”中个体异化的危险。如果说艺术表现着人们心灵的形状，那么这一形状正在被技术深深地改变着。针对这一问题，艺术家们如果想有所作为，只能从技术的核心和机制中展开工作，而aaajiao由于所学学科的原因正处于这一位置，他直接面对并紧紧拥抱了革新中的技术和思想，从对技术的反思中探索着人类精神的安全出口，同时赋予作品以新的思维和美学。",
    "description_en": "We are pleased to announce that HOW Art Museum (Shanghai) will be hosting a solo exhibition of aaajiao/Xu Wenkai aaajiao: an ID from April 27, 2019 until July 14, 2019. This show is part of HOW NOW exhibition series featuring young Chinese artists. In 1989, the world wide web was created at the hands of the English scientist Tim Berners-Lee. aaajiao (Xu Wenkai) is part of the generation who grow up within this interconnected network and experienced the process of technological digitalization firsthand. Yet, thirty years later people are still incapable of summing up in one sentence all the changes that the internet has brought. aaajiao holds the perspective that, with the plethora of possibilities and immense satisfaction technology has brought with it a host of new dilemmas and crises: individual existence is increasingly defined online and in the form of numbers, the tightening of the internet makes the extensiveness of connectedness more immediate, causing the notions of ‘freedom’ and 'independence’ to become abstract concepts outside the range of perception. The attainment and ascendance of an unfathomable amount of data paired with the unprecedented penetration of preeminence via technology make governance evermore convenient. People are increasingly faced with the danger of individual alienation by becoming what Edward O. Wilson described as ‘Eusocial Organisms’. If art represents the state of people's minds, then its form is in the process of being profoundly altered by technology. Faced with the given predicament, if artists hope to play any sort of role in all of this, then they must first posit their practices at the core of the technological mechanism. Due to aaajiao’s background, he welcomes and fully embraces new technology and thought brought about by this revolution; exploring the potential emergency exit for the psychological disposition of human beings through reflecting on technology while proposing a new way of thinking and aesthetics in the form of artworks.",
    "video_link": "https://player.vimeo.com/video/343170043",
    "size": "",
    "duration": "",
    "tags": []
  },
  {
    "url": "https://eventstructure.com/aaajiao-Untitled",
    "title": "Untitled",
    "title_cn": "不确定",
    "type": "Exhibition",
    "materials": "",
    "year": "2015-2016",
    "description_cn": "杨画廊将于2015年12月12日呈现新的展览“aaajiao – 不确定”。这是艺术家aaajiao在杨画廊的第一次个展，展览将持续至2016年2月29日。aaajiao在作品创作中倾向使用跨领域的语言，如建筑、电子音乐、表演、产品设计、医学等，去探索数据处理、自媒体领域以及信息过滤，以及聚焦于今天消费网络技术、生活于社交媒体中的青年一代。这代人被艺术家称之为“屏幕一代”。",
    "description_en": "A new exhibition in Gallery Yang, “aaajiao – Untitled”, is set to open on December 12th, 2015. It is the first solo exhibition of artist aaajiao presented by Gallery Yang, and will last till February 29th, 2016. In his works, aaajiao tends to employ languages of multiple fields, such as architecture, electronic music, performance, product design, and medicine, to study data processing and we-media, focusing on the young generation who are consuming internet technology and living by social media. He calls them “the screen generation”. In his view, screen has become another side of man, and vice versa. Not only is instrument an extension of man, it also has its own properties of growth, even its own will. In an era of high technology, this will, through effective dissemination and promotion is easier than ever to infiltrate into the systems of self-organization and self-management of man. It seems that the modern science, after shaking off the old religions, has created a new one. Only now we have no need for passionate will to sustain some metaphysical or transcendent world. Today, visual and aural machines are developing very fast, and we are increasingly outsourcing to the feelers of science the task of feeling the world. As a result, a life of continuous attracting and dumping, surprise and oblivion, wraps up like onion peel our human experiences, which, existing either in virtual or real world, are seamless in the eyes of the artist. In contrast to the rational spirit, today’s experiences lie scattered and mixed on the playground of time like two defeated troops. And aaajiao’s works strive to face these disorderly experiences and present them to audience in a unique artistic code.",
    "video_link": "",
    "size": "",
    "duration": "",
    "tags": []
  },
  {
    "url": "https://eventstructure.com/ai-ai-ai",
    "title": "ai ai ai",
    "title_cn": "爱爱爱",
    "type": "Installation",
    "materials": "Embroidered handkerchief, digital print / 刺绣手帕，数码打印，金属结构",
    "year": "2024 - 2025",
    "description_cn": "收集一张二次元形象与战争图像拼贴成看似无意义的迷因，印绣在丝质手帕上；手帕一方方系在一起，如同火灾中人们用家中布料结成的逃生绳。那些在互联网里流动的无意义迷因，又何尝不是无数人抵抗孤独、悄然求救的绳索。",
    "description_en": "A collage of an anime-styled figure and war imagery—apparently “meaningless” as a meme—is printed and embroidered on silk handkerchiefs. Knotted square to square, they recall escape ropes improvised from household cloth during a fire. The internet’s “meaningless” memes can likewise be lifelines: cords against loneliness, quiet signals for help.",
    "video_link": "",
    "size": "",
    "duration": "",
    "tags": []
  },
  {
    "url": "https://eventstructure.com/alias-aaajiao",
    "title": "alias: aaajiao",
    "title_cn": "代号：aaajiao",
    "type": "Exhibition",
    "materials": "Site-specific sculpture, algorithm-generated sponges, video, photographs, digital rendering, sculpture prototype, tattoo patterns",
    "year": "2015",
    "description_cn": "LEO XU PROJECTS为大家展出活跃于国际新媒体艺术界的年轻艺术家徐文恺的首次个展。本次展览展示了aaajiao围绕互联网和数码技术对当代生活界限的探索，展品中包含了现场造型的雕塑《枯山水》，以及探索地质进化的《有限的无限风景》等作品。",
    "description_en": "LEO XU PROJECTS presents the first solo exhibition of the young Chinese media artist Xu Wenkai, known online as aaajiao. The exhibition features new works addressing issues of contemporary living with internet and digital technology. A highlight is the sculpture 'Karesansui', made of sponges that resemble rocks, creating a dystopian landscape of black mutant limbs throughout the gallery. Other featured works include 'Obj. 3' and 'Obj. 4', which are video portraits of stones, and an ongoing series 'Limited Landscape, Unlimited' exploring geologic evolution through algorithmic study.",
    "video_link": "https://player.vimeo.com/video/117770120",
    "size": "",
    "duration": "",
    "tags": []
  },
  {
    "url": "https://eventstructure.com/anti-cybernetics",
    "title": "anti-cybernetics",
    "title_cn": "反网络主义",
    "type": "Interactive Installation",
    "materials": "wood, led controller",
    "year": "2010",
    "description_cn": "",
    "description_en": "aaajiao solo exhibition: cybernetics. Caution: automatic open and close wood box, with a high volume led light.",
    "video_link": "",
    "size": "",
    "duration": "",
    "tags": []
  },
  {
    "url": "https://eventstructure.com/anomaly",
    "title": "Anomaly",
    "title_cn": "不规则",
    "type": "Installation",
    "materials": "Sponges",
    "year": "2015",
    "description_cn": "《不规则》（2015）以比陨石更诡异的形态将科幻作品中对异形的美、黑暗的美的想象物化、移植进了日常空间。 This piece was done in collaboration with Xu Cong. / 作品是与许聪共同完成。",
    "description_en": "“Anomaly” (2015)—produced identically to “Karesansui” in technique and material but done in the shape of meteors—this work celebrates the classic beauty of dark imagination of biological and physical mutation that has been frequently manifested in sci-fi cinema and visual representation.",
    "video_link": "",
    "size": "",
    "duration": "",
    "tags": []
  },
  {
    "url": "https://eventstructure.com/archive-Candy-Wrappers",
    "title": "archive.Candy Wrappers",
    "title_cn": "档案糖纸",
    "type": "Video",
    "materials": "Single channel video, color; screen, cables / 单频彩色录像、屏幕、线",
    "year": "2017",
    "description_cn": "",
    "description_en": "Video based on / 视频根据 https://eventstructure.com/Org-a",
    "video_link": "https://player.vimeo.com/video/226674808",
    "size": "",
    "duration": "",
    "tags": []
  },
  {
    "url": "https://eventstructure.com/bits-of-information",
    "title": "bits of information",
    "title_cn": "信息碎片",
    "type": "Installation",
    "materials": "Etching copper × 59",
    "year": "2015",
    "description_cn": "源于2013年的视频/程序作品Meta, 将Meta中实时生成的3D形态碎化并构成2D的信息碎片.",
    "description_en": "Based on the 2013 video/program work Meta, the real-time generative 3D shape of Meta is shredded and constitutes 2D information bits.",
    "video_link": "",
    "size": "",
    "duration": "",
    "tags": []
  },
  {
    "url": "https://eventstructure.com/biubiu",
    "title": "biubiu",
    "title_cn": "biubiu",
    "type": "Digital printing",
    "materials": "UV, film",
    "year": "2021",
    "description_cn": "一组用iPhone制造的图片，用菲林打印的方式呈现在窗户上，借助自然光呈现不同的灰度，图片成了对使用手机去观看的结果，也是我尝试去描述看见的过程，那些在记忆中会闪回又模糊的构成生活的大面积空洞，失败的细节。",
    "description_en": "This group of images was made with iPhone, presented on the window by way of film printing, with the help of natural light to show different shades of grey. These images became the result of using the iPhone to see and my attempt to describe the process of seeing. Those that would flashback and blur in memory constitute a large void in life, failure details.",
    "video_link": "",
    "size": "",
    "duration": "",
    "tags": []
  },
  {
    "url": "https://eventstructure.com/bot",
    "title": "bot / 观察者",
    "title_cn": "观察者",
    "type": "Single channel video, color; Website / 单频彩色录像、网站",
    "materials": "Dimension variable / 尺寸可变",
    "year": "2017-2018",
    "description_cn": "此作品与圈圈共同完成。aaajiao的作品《观察者》展示了一个深深交织于数字过去和当下的环境。在这片交汇处，本地与全球网络、社交媒体、园林结构、公园、以及最终出现的自然本身，都合并至一种数字化的超表象（hyper-representation）之中。作品从角色扮演动作游戏借鉴了大量的美学元素，反映出一个既熟悉又略显反乌托邦的世界。在这个数字空间中，物理与虚拟的界限变得模糊，引导观众思考机器学习时代下的记忆的本质。",
    "description_en": "This piece was done in collaboration with Quanquan. aaajiao displays an environment deeply intertwined with a digital past as well as its present counterpart. Reflecting on this intersection, local and global networks, social media, gardening structures, parks, and nature all become amalgamated into a digital hyper-representation. The work borrows aesthetics from existing role-playing action games, reflecting a world that is at once familiar yet slightly dystopian. In this digital space, the boundaries between the physical and the virtual blur, leading viewers to question the nature of memory in the age of machine learning.",
    "video_link": "https://player.vimeo.com/video/269875758",
    "size": "",
    "duration": "",
    "tags": []
  },
  {
    "url": "https://eventstructure.com/bot-Berlin",
    "title": "bot",
    "title_cn": "",
    "type": "Single channel video, Installation",
    "materials": "Video, Inflatable objects, 3D printing",
    "year": "2018",
    "description_cn": "",
    "description_en": "The work 'bot' is a single-channel video that reflects on the consumption of digital media by presenting a surreal representation of personal experiences combined with social media narratives. The accompanying installation, 'bots,' consists of nine unique inflatable objects, serving as a physical manifestation of digital concepts. Through this, aaajiao critiques the impact of game culture and social media on perception and reality.",
    "video_link": "https://player.vimeo.com/video/291484133",
    "size": "",
    "duration": "",
    "tags": []
  },
  {
    "url": "https://eventstructure.com/bots",
    "title": "bots",
    "title_cn": "观察者们",
    "type": "installation",
    "materials": "PVC inflatables / PVC 气体模型",
    "year": "2017-2018",
    "description_cn": "作品是与许聪共同完成。",
    "description_en": "This piece was done in collaboration with XuCong.",
    "video_link": "",
    "size": "",
    "duration": "",
    "tags": []
  },
  {
    "url": "https://eventstructure.com/cloud-data-app",
    "title": "cloud.data",
    "title_cn": "",
    "type": "app",
    "materials": "acrylic ipad",
    "year": "2010",
    "description_cn": "",
    "description_en": "In the ancient legend, gestures have different mysterious powers. With these gestures and singings, people may get courage, mercy, intelligence or calm. Collecting the gesture and touch data to generate and control the cloud. With the music sound, it will give you the mental and emotional balance.",
    "video_link": "",
    "size": "",
    "duration": "",
    "tags": []
  },
  {
    "url": "https://eventstructure.com/cursor-traces",
    "title": "cursor-traces",
    "title_cn": "光标痕迹",
    "type": "JavaScript library",
    "materials": "Dimension variable / 尺寸可变",
    "year": "2022",
    "description_cn": "作品是与 许聪 共同完成。",
    "description_en": "This piece was done in collaboration with XuCong.",
    "video_link": "https://www.npmjs.com/package/cursor-traces",
    "size": "",
    "duration": "",
    "tags": []
  },
  {
    "url": "https://eventstructure.com/foam-wave",
    "title": "foam wave",
    "title_cn": "棉的浪",
    "type": "installation",
    "materials": "海绵，UV打印 ／ foam, UV print",
    "year": "2017",
    "description_cn": "这个名为「棉的浪」的装置通过多种UV打印探索了泡沫的物理属性。尺寸可变，允许在展览空间中适应。",
    "description_en": "This installation, titled 'foam wave', explores the physicality of foam through various UV prints. The dimensions are variable, allowing for adaptability in exhibition spaces.",
    "video_link": "",
    "size": "",
    "duration": "",
    "tags": []
  },
  {
    "url": "https://eventstructure.com/ddrk-me",
    "title": "ddrk.me / 低端影视",
    "title_cn": "ddrk.me / 低端影视",
    "type": "Installation / 装置",
    "materials": "Thin film, protective film on UV / 薄膜，保护膜上UV",
    "year": "2021",
    "description_cn": "ddrk.me是一个叫作低端影视的网站，观察域名不难发现，“ddrk”并不是“低端影视”的拼音首字，尝试拼出来，发现是“低端人口”，在网站的关于页面，站长写道：“我们的目标是提供最便捷的，同时支持电脑和移动设备的超清画质在线观看影视剧体验。域名ddrk.me是站长自嘲，不是指访问本站的您，请勿对号入座。”我习惯性地查看了域名的whois信息并记录了下来，把这些信息打印在工业薄膜上，放进空间中，薄膜很容易产生静电，会黏在皮肤上，地上墙上，也会吸附灰尘。",
    "description_en": "ddrk.me is a website called Low-End Film and TV. It is not difficult to figure that “ddrk” is not the pinyin initials of 'Low-End Film and TV', but of 'Low-End Population' (dī duān rén kǒu). On the About page of the website, the webmaster writes that “Our goal is to provide the most convenient online viewing experience for both computers and mobile devices with ultra-clear picture quality. The domain name ddrk.me is self-deprecating and does not refer to you as a visitor to the site, so please do not take it personally.\" I habitually checked the domain name's whois information, recorded it, later printed it on industrial films, and included them in the space. These films easily generate static electricity, stick to the skin, the floor and walls, and absorb dust.",
    "video_link": "",
    "size": "",
    "duration": "",
    "tags": []
  },
  {
    "url": "https://eventstructure.com/fur",
    "title": "fur",
    "title_cn": "毛",
    "type": "installation",
    "materials": "stuffed object, eyes toy / 毛绒物体, 眼睛玩具",
    "year": "2019-2020",
    "description_cn": "《毛》是一件由毛绒物体组成的装置艺术，形状似各种动物，拥有生动的眼睛，深刻反映我们与自然和物体的关系。该作品是与许聪共同完成。",
    "description_en": "Fur is an installation composed of stuffed objects that resemble various animals, featuring poignant eyes, creating a reflection on our relationships with nature and objects. This work was made possible with the collaboration of Xu Cong.",
    "video_link": "",
    "size": "",
    "duration": "",
    "tags": []
  },
  {
    "url": "https://eventstructure.com/gumdrop",
    "title": "gumdrop",
    "title_cn": "橡皮软糖",
    "type": "installation",
    "materials": "Cellophane, UV printing, digital printing, acrylic wood",
    "year": "2017 - 2019",
    "description_cn": "一个使用玻璃纸和各种印刷技术的装置作品，展示了所用材料的特殊性质。",
    "description_en": "An installation work utilizing cellophane and various printing techniques, featuring a unique design that showcases the properties of the materials used.",
    "video_link": "",
    "size": "",
    "duration": "",
    "tags": []
  },
  {
    "url": "https://eventstructure.com/icon-002-005",
    "title": "Screen printing, chevron board, metal frame, acrylic paint / 丝网印刷, 雪弗板, 金属框, 水性漆",
    "title_cn": "Screen printing, chevron board, metal frame, acrylic paint / 丝网印刷, 雪弗板, 金属框, 水性漆",
    "type": "Print",
    "materials": "Screen printing, chevron board, metal frame, acrylic paint / 丝网印刷, 雪弗板, 金属框, 水性漆",
    "year": "2018",
    "description_cn": "本系列使用雪弗板结合金属框架和水性漆的丝网印刷，展示了传统印刷技术与现代材料的结合。",
    "description_en": "A series of screen prints using chevron board in combination with metal frames and acrylic paint, showcasing a blend of traditional printmaking techniques and contemporary materials.",
    "video_link": "",
    "size": "",
    "duration": "",
    "tags": []
  },
  {
    "url": "https://eventstructure.com/icon-2018-2022-Diaspora-as-History",
    "title": "icon 2018 - 2022",
    "title_cn": "",
    "type": "Installation",
    "materials": "screen printing, chevron board, metal frame, acrylic paint",
    "year": "2018-2022",
    "description_cn": "",
    "description_en": "Icon 2018 - 2022 is a series of artworks that explores the concept of diaspora through various visual mediums. Each piece utilizes screen printing techniques on chevron boards framed in metal, reflecting both a contemporary aesthetic and thematic depth.",
    "video_link": "",
    "size": "",
    "duration": "",
    "tags": []
  },
  {
    "url": "https://eventstructure.com/icon011",
    "title": "icon011",
    "title_cn": "icon011",
    "type": "Installation / 装置",
    "materials": "Screen printing, chevron board, metal frame, acrylic paint / 丝网印刷，雪弗板，金属框，水性漆",
    "year": "2020-2021",
    "description_cn": "“Icon”系列是对User描摹，用手机app Pixelable 像发社交媒体动态一样，手指和智能设备的摩擦，碎片状的注意力相互敲击，听到回声，留在屏幕上。",
    "description_en": "The “icon” series portrays the User using the mobile app Pixelable to send social media updates. Among the friction of fingers and smart devices, fragmented attention taps against each other, hearing echoes that remain on the screen.",
    "video_link": "",
    "size": "",
    "duration": "",
    "tags": []
  },
  {
    "url": "https://eventstructure.com/icongif-003-009",
    "title": "icongif 003-009",
    "title_cn": "",
    "type": "installation / 装置",
    "materials": "Led screen, gif / LED屏幕, gif",
    "year": "2019",
    "description_cn": "",
    "description_en": "A series of installations consisting of animated gifs displayed on small LED screens. Each piece is a compact 16 x 16 x 6 cm in size, utilizing visual motifs that incorporate digital aesthetics and contemporary themes of information overload and digital presence.",
    "video_link": "",
    "size": "",
    "duration": "",
    "tags": []
  },
  {
    "url": "https://eventstructure.com/icongif-010-011",
    "title": "icongif 010 / icongif 010",
    "title_cn": "icongif 010 / icongif 010",
    "type": "Installation",
    "materials": "Led screen, gif / LED屏幕, gif",
    "year": "2019-2020",
    "description_cn": "通过LED屏幕展示引人入胜的GIF动画的视觉艺术作品。",
    "description_en": "A visual art piece utilizing LED screens to display captivating GIF animations.",
    "video_link": "",
    "size": "",
    "duration": "",
    "tags": []
  },
  {
    "url": "https://eventstructure.com/infinite",
    "title": "Turritopsis Nutricula / 免疫水母",
    "title_cn": "免疫水母",
    "type": "Computer Generated Moving Image installation",
    "materials": "computer graphics, sound",
    "year": "2011",
    "description_cn": "",
    "description_en": "Turritopsis Nutricula(infinite app) has to do with this mysterious natural phenomenon, which is beyond all cognition on human nature. The jellyfish reproduces itself asexually and its cells split continuously, from infancy to adulthood, and adulthood back to infancy. It is evidence of immortality found in nature. aaajiao transfers the jellyfish from the living into the digital form, as the examination and reflection on this phenomenon.",
    "video_link": "",
    "size": "",
    "duration": "",
    "tags": []
  },
  {
    "url": "https://eventstructure.com/integriert-qualifiziert-nicht-integriert",
    "title": "放心 integriert / 一般 qualifiziert / 不放心 nicht integriert",
    "title_cn": "放心 integriert / 一般 qualifiziert / 不放心 nicht integriert",
    "type": "Installation",
    "materials": "transfer sticker, font",
    "year": "2024",
    "description_cn": "",
    "description_en": "This installation features a chart circulated on the internet that records the scoring of Uighur residents by a Chinese government agency. It highlights the violent implications of language as it relates to identity and government control. The piece utilizes two official fonts from China and Germany, while also sourcing documents for authenticity verification.",
    "video_link": "https://vimeo.com/1813568068",
    "size": "",
    "duration": "",
    "tags": []
  },
  {
    "url": "https://eventstructure.com/landscape-001",
    "title": "landscape 001",
    "title_cn": "landscape001",
    "type": "Installation",
    "materials": "screen printing, silicone skin, acrylic, oil-based paint",
    "year": "2022",
    "description_cn": "",
    "description_en": "This work explores the intersection of digital and physical landscapes, utilizing various materials including screen printing and silicone to create an immersive installation. It measures 180 x 170 cm and was completed in 2022.",
    "video_link": "",
    "size": "",
    "duration": "",
    "tags": []
  },
  {
    "url": "https://eventstructure.com/landscape-002",
    "title": "landscape 002",
    "title_cn": "",
    "type": "Installation",
    "materials": "screen printing, silicone skin, acrylic, oil-based paint",
    "year": "2022",
    "description_cn": "",
    "description_en": "A large-scale installation featuring a combination of screen printing with silicone skin and acrylic. The artwork measures 200 x 200 cm.",
    "video_link": "",
    "size": "",
    "duration": "",
    "tags": []
  },
  {
    "url": "https://eventstructure.com/landscape-003",
    "title": "landscape 003",
    "title_cn": "",
    "type": "Installation",
    "materials": "screen printing, silicone skin, acrylic, oil-based paint",
    "year": "2022",
    "description_cn": "",
    "description_en": "landscape 003 is a work that explores the interface and coexistence of natural and artificial environments through the use of screen printing on silicone skin, mixed with acrylic and oil-based paints. This large-scale piece measures 222 x 109 cm.",
    "video_link": "",
    "size": "",
    "duration": "",
    "tags": []
  },
  {
    "url": "https://eventstructure.com/landscape000",
    "title": "landscape000",
    "title_cn": "风景000",
    "type": "Installation",
    "materials": "Screen printing, silicone skin, acrylic, oil-based paint / 丝网印刷，硅胶皮，亚克力，油性漆",
    "year": "2018-2021",
    "description_cn": "在公园里打坐的人，在地铁里享受春日阳光的人，在炽热的水泥地面穿着融化拖鞋散步的人，爬出城市水系的人，在这些规训的景观中，我看见自洽的失落，悲伤的无聊，臃肿的情绪，一堆景观。",
    "description_en": "Those who meditate in the park, who enjoy the spring sun in the subway, who walk in melting slippers on a blazing hot concrete floor and who climb out of the city water system, in these regimented landscapes I see the loss of self-consistency, sad boredom, bloated emotions, a bunch of landscapes.",
    "video_link": "",
    "size": "",
    "duration": "",
    "tags": []
  },
  {
    "url": "https://eventstructure.com/landscape_005",
    "title": "landscape 005",
    "title_cn": "landscape 005 动森限定",
    "type": "Variable size, variable media",
    "materials": "Variable size, variable media",
    "year": "2018,2020",
    "description_cn": "该作品名为'landscape 005'，包含来自《动物之森》游戏的元素，以可变的形式呈现，允许多样的解读和形式。",
    "description_en": "This artwork, titled 'landscape 005', includes elements from the game Animal Crossing, presented in a variable format allowing for diverse interpretations and forms.",
    "video_link": "",
    "size": "",
    "duration": "",
    "tags": []
  },
  {
    "url": "https://eventstructure.com/light_7-pmap",
    "title": "light_7.pmap",
    "title_cn": "",
    "type": "installation / 装置",
    "materials": "USB flash drive, .pmap file / 优盘, pmap文件",
    "year": "2017",
    "description_cn": "无",
    "description_en": ".pmap 是maya私有文件光文件扩展名，一个名为 light_7.pmap， 体积 211KB 的光文件储存在优盘里。这样我们便拥有了光。\n\n*mental ray 光子贴图文件 (.pmap)。一种二进制文件，mental ray 渲染器可以使用该文件生成焦散和全局照明效果。",
    "video_link": "",
    "size": "",
    "duration": "",
    "tags": []
  },
  {
    "url": "https://eventstructure.com/meta",
    "title": "Meta",
    "title_cn": "元",
    "type": "Video Installation",
    "materials": "LCD screen, PCB, wood fittings",
    "year": "2013-2014",
    "description_cn": "作品是与许聪共同完成。Meta是对信息（data）在未来如何呈现的猜想,它并聚焦在视觉的部分，而是通过呈现视觉构成的过程来研究我们所面对的可视化问题，即可视化的数据和真相是否有关，还只是另一种视觉腐败（语言腐败; 1984，“decay of the language”/“decline of the language”）的过程。",
    "description_en": "This piece was done in collaboration with Xu Cong. Meta is a conjecture on how data is presented in the future. It focuses on the visual part, but through the process of presenting visual composition to study the visualization problems we face, whether the visualized data is related to the truth or not. It's just another process for decay of the visual (1984 - George Orwell, \"decay of the language\" / \"decline of the language\").",
    "video_link": "",
    "size": "",
    "duration": "",
    "tags": []
  },
  {
    "url": "https://eventstructure.com/memory-vending-machines",
    "title": "Memory Vending Machines",
    "title_cn": "记忆贩卖机",
    "type": "Video Installation",
    "materials": "3×Screen, 120×70×170",
    "year": "2009",
    "description_cn": "记忆贩卖机（2009），是艺术家基于可预见的科技进步（纳米技术、生物科技）所提出的一项“发明”。装置的外形与基本功能类似于扭蛋机，这是一种简易自助式贩售系统，在遍布全市的便利店都可以找到。与普通扭蛋机不同，根据艺术家的设想，记忆贩卖机所售出的每一枚扭蛋看似中空，其实封装有无数个微小的纳米级机器人。随着用户吸入扭蛋内的空气，这些携带特殊信息的纳米机器人就进入脑部，附着繁殖，形成记忆区域，并且同样购买并服用“记忆扭蛋”的个体之间，可以通过记忆区域相互通讯。这实际上意味着：人们可以进入彼此的记忆，完全获取包括视觉、听觉、触觉、味觉、嗅觉……在内的感官经验，并在自己的机体上获得全部“真实”的体验（还原）。装置上的电子屏幕播放着说明性的动画，向观众介绍这项“发明”的原理和用途。",
    "description_en": "Memory Vending Machines (2009) is an “invention” proposed by the artist based on the predicted scientific advancement (nano, biotech). The appearance and basic functions of this installation are similar to that of Capsule Vending Machine. This kind of easy-to-use self-service vending machines can be found in convenience shops across the entire city. Different from general Capsule Vending Machines, this Memory Vending Machine sells capsules, which, based on the conception by the artist, seem empty inside but have actually encapsulated numerous tiny nano-robots. Inhaled by the user of the air inside the capsule, these nano-robots carrying special data will enter and colonize the human brains, and propagate themselves to form memory zones. In addition, different individuals can communicate with each other, which actually means people can enter each other’s memories and fully read sensory information including vision, hearing, feeling, tasting, olfaction, etc., and acquire the whole “real” experience (revivification) on its own organic body. Descriptive animation is played on the electronic screen of the installation, elaborating the visitors on the principles and purposes of this “invention”.",
    "video_link": "",
    "size": "",
    "duration": "",
    "tags": []
  },
  {
    "url": "https://eventstructure.com/natural-materials",
    "title": "natural materials",
    "title_cn": "自然材料",
    "type": "installation",
    "materials": "Memory Foam, Net Bag, PVC, Car Film, Aluminum Plate, Natural Rosin, Foam Packaging, Tinfoil Insulation Material, Soda Crackers/ 记忆海绵, 网兜, PVC, ⻋膜, 铝塑版, 天然松香,泡沫包装, 锡纸保温材料, 苏打饼干",
    "year": "2017-2019",
    "description_cn": "使用多种自然材料制作的装置，探讨纹理和有机形状的主题。",
    "description_en": "Installation made using various natural materials to explore themes of texture and organic forms.",
    "video_link": "",
    "size": "",
    "duration": "",
    "tags": []
  },
  {
    "url": "https://eventstructure.com/nature",
    "title": "nature",
    "title_cn": "自然",
    "type": "Installation",
    "materials": "Polyurethane foam for fire protection / 聚氨酯泡沫防火板",
    "year": "2018-2019",
    "description_cn": "该艺术作品采用聚氨酯泡沫防火板创作，表达自然主题。作品尺寸为180 x 180厘米，完成于2018年至2019年。",
    "description_en": "The artwork is created using polyurethane foam for fire protection, representing the theme of nature. It measures 180 x 180 cm and was completed between 2018 and 2019.",
    "video_link": "",
    "size": "",
    "duration": "",
    "tags": []
  },
  {
    "url": "https://eventstructure.com/nature-2017-19",
    "title": "nature",
    "title_cn": "自然",
    "type": "installation",
    "materials": "extruded polystyrene foam board, metal frame / 防火泡沫板，金属结构",
    "year": "2017-2019",
    "description_cn": "该作品是一件由防火泡沫板和金属框架制成的装置，突显自然的精妙形式。",
    "description_en": "This work features an installation made from extruded polystyrene foam board and a metal frame, highlighting nature's intricate forms.",
    "video_link": "",
    "size": "",
    "duration": "",
    "tags": []
  },
  {
    "url": "https://eventstructure.com/observe",
    "title": "digital printing",
    "title_cn": "数码打印",
    "type": "Digital Printing",
    "materials": "150cm ＊ 150cm, acrylic fittings / 压克力组件",
    "year": "2015",
    "description_cn": "作品是与刘晓光共同完成，探讨了数码打印这种媒介的细微差别，强调了艺术创作的合作性质。",
    "description_en": "Made possible with the collaboration of Liu Xiaoguang. This piece explores the nuances of digital print as a medium and emphasizes the collaborative nature of art-making.",
    "video_link": "",
    "size": "",
    "duration": "",
    "tags": []
  },
  {
    "url": "https://eventstructure.com/party",
    "title": "party",
    "title_cn": "派对",
    "type": "website, video / 网站, 视频",
    "materials": "Dimension variable / 尺寸可变",
    "year": "2019",
    "description_cn": "作品是与许聪共同完成。",
    "description_en": "This piece was done in collaboration with XuCong.",
    "video_link": "https://player.vimeo.com/video/357517262",
    "size": "",
    "duration": "",
    "tags": []
  },
  {
    "url": "https://eventstructure.com/ornaments",
    "title": "The Screen Generation / 屏幕一代",
    "title_cn": "屏幕一代",
    "type": "Jewelry Installation",
    "materials": "3D-printed resin, sugar paste, permanent magnet, red copper, cloth, abstract screens",
    "year": "2013",
    "description_cn": "2013年，媒体艺术家aaajiao(徐文恺)开展了艺术项目《屏幕一代》，在北京、上海举办了多次展览。该项目的内容从装置展延展到表演，涵盖了视觉与触觉之间的界限。此次展出的首饰与《屏幕一代》中的六件视频装置（柔软、反复、坚硬、纯粹、静止和闹）相契合，象征不同的人性特点和情感。这些作品挑战了传统首饰的装饰性，使之增进与身体的互动和对话。",
    "description_en": "In 2013, media artist aaajiao (Xu Wenkai) launched an art project titled 'The Screen Generation', exhibited numerous times in Beijing and Shanghai. This project evolved from installations to performances and between vision and touch. The jewelry here conceptualizes extensions based on 6 video installations—Soft, Repeatedly, Hard, Pure, Static, and Noise—representing various human characteristics and emotions. The pieces engage the audience, challenging the traditional notion of jewelry as merely decorative, to foster interaction and dialogue with the body.",
    "video_link": "https://player.vimeo.com/video/93179665",
    "size": "",
    "duration": "",
    "tags": []
  },
  {
    "url": "https://eventstructure.com/protester-cursor-emoji",
    "title": "protester/cursor/emoji",
    "title_cn": "抗议者/光标/表情符号",
    "type": "Website",
    "materials": "",
    "year": "2019",
    "description_cn": "",
    "description_en": "A website designed to explore the interplay between cursor movement and emoji representation.",
    "video_link": "",
    "size": "",
    "duration": "",
    "tags": []
  },
  {
    "url": "https://eventstructure.com/protester-cursor-eyes",
    "title": "protester/eyes",
    "title_cn": "protester/eyes",
    "type": "Website",
    "materials": "code base on",
    "year": "2020",
    "description_cn": "",
    "description_en": "A web-based project utilizing cursor effects and providing a digital interaction exploring the representation of eyes.",
    "video_link": "",
    "size": "",
    "duration": "",
    "tags": []
  },
  {
    "url": "https://eventstructure.com/rhizomes",
    "title": "rhizomes",
    "title_cn": "根茎",
    "type": "Installation",
    "materials": "PLA, Wax, Magnets / PLA ，蜡，磁铁",
    "year": "2021",
    "description_cn": "这是一个与WLL合作创作的装置，探讨了连接和生长的主题。作品尺寸为30厘米 x 38厘米 x 100厘米，于2021年完成。",
    "description_en": "An installation created collaboratively with WLL, featuring a unique structure that explores the themes of connection and growth. The piece measures 30cm x 38cm x 100cm and was completed in 2021.",
    "video_link": "",
    "size": "",
    "duration": "",
    "tags": []
  },
  {
    "url": "https://eventstructure.com/spectrogram",
    "title": "spectrogram",
    "title_cn": "",
    "type": "Performance",
    "materials": "Concept: aaajiao, B6; Sound: B6; Computer Graphics: aaajiao, Liu Xiaoguang",
    "year": "2012",
    "description_cn": "",
    "description_en": "A performance that integrates various elements of sound and computer graphics, exploring deep interactions between different media.",
    "video_link": "",
    "size": "",
    "duration": "",
    "tags": []
  },
  {
    "url": "https://eventstructure.com/the-last-media",
    "title": "The Last Media",
    "title_cn": "末日媒体",
    "type": "Video",
    "materials": "Dimension variable",
    "year": "2019",
    "description_cn": "社会运动甚至是这次的瘟疫（新冠病毒），传统媒体，社交媒体，自媒体都沉浸在他们共建的媒体图景之中，而对于一个体，不再有能力通过媒体看到社会真相，一方面是信息的流通方式的巨变，另一方面是现在媒体状况的急剧恶化，这是媒体的盛宴，也是媒体的末日。",
    "description_en": "Social movements, even the plague of this time (COVID-19), traditional media, social media, and self-media, all indulge in the media landscape they have co-created. For an individual, there is no longer the ability to see the social truth through the media; on one hand is the huge change in the way information circulates, on the other hand is the rapid deterioration of the current media situation. It is both a feast and an apocalypse for the media.",
    "video_link": "https://player.vimeo.com/video/356446660",
    "size": "",
    "duration": "",
    "tags": []
  },
  {
    "url": "https://eventstructure.com/totem",
    "title": "Totem",
    "title_cn": "图腾",
    "type": "Sculpture",
    "materials": "Resin, sponge, metal structure",
    "year": "2015",
    "description_cn": "高度信息化的新族群的图腾",
    "description_en": "Highly informative new ethnic totem",
    "video_link": "",
    "size": "",
    "duration": "",
    "tags": []
  },
  {
    "url": "https://eventstructure.com/typeface",
    "title": "typeface",
    "title_cn": "字体",
    "type": "Installation",
    "materials": "USB installation, 10' LED screen, typeface file, wallpaper",
    "year": "2016",
    "description_cn": "没有含义的字体:利用人工神经网络算法教机器学习书法。作品是与圈圈共同完成。typeface 是一项艺术实验，旨在探索古老的文字，在通过数字化手段不断重复解构、重构的过程中意义的丧失。",
    "description_en": "Meaningless font: created by a deep convolutional generative adversarial network (DCGAN) trained on calligraphy collection. Made possible with the collaboration of Quanquan. Typeface is an art experiment, aims to explore the ancient text, in the digital means by repeating the process of deconstruction and reconstruction of the loss of meaning.",
    "video_link": "https://github.com/aaajiao/typeface",
    "size": "",
    "duration": "",
    "tags": []
  },
  {
    "url": "https://eventstructure.com/Sacpe-data",
    "title": "Sacpe.data",
    "title_cn": "",
    "type": "Video or Live performance",
    "materials": "N/A",
    "year": "2006-2007",
    "description_cn": "",
    "description_en": "Conceptualized by aaajiao and yang2 with sound composition by yang2. This work displays a 15-minute video or live performance that intertwines computer graphics and video editing, all executed by aaajiao.",
    "video_link": "http://vimeo.com/256215",
    "size": "",
    "duration": "",
    "tags": []
  },
  {
    "url": "https://eventstructure.com/exist",
    "title": "exist",
    "title_cn": "",
    "type": "sculpture",
    "materials": "3D打印树脂 / 3D printing Resin",
    "year": "2015",
    "description_cn": "作品是与许聪共同完成。",
    "description_en": "This piece was done in collaboration with Xu Cong.",
    "video_link": "",
    "size": "",
    "duration": "",
    "tags": []
  },
  {
    "url": "https://eventstructure.com/Static",
    "title": "Static",
    "title_cn": "静止",
    "type": "installation",
    "materials": "size 280cm × 102cm × 30cm",
    "year": "2013",
    "description_cn": "模拟屏幕漏光的动态,富有诗意,如果我们是屏幕,这一刻应该是静止的。",
    "description_en": "Simulating the screen light leakage can create and develop the dynamic.This is poetic in essence as if we are the screen itself, this moment should be stationary.",
    "video_link": "",
    "size": "",
    "duration": "",
    "tags": []
  },
  {
    "url": "https://eventstructure.com/a-aa-aaa-aaaa-aaaaa",
    "title": "a aa aaa aaaa aaaaa",
    "title_cn": "",
    "type": "3D printing",
    "materials": "SLA UV resin, PLA polylactide, TPU thermoplastic polyurethane, magnet",
    "year": "2020",
    "description_cn": "",
    "description_en": "",
    "video_link": "",
    "size": "",
    "duration": "",
    "tags": []
  },
  {
    "url": "https://eventstructure.com/aaajiao-Cybernetics-exhibition-catalog",
    "title": "aaajiao: ‘Cybernetics’ exhibition catalog",
    "title_cn": "",
    "type": "Catalog",
    "materials": "N/A",
    "year": "2010",
    "description_cn": "",
    "description_en": "This catalog reflects works from the Cybernetics series, made by the artist in 2009 and 2010, aiming to systematically examine the ways of thinking, art-making, expressing, and presenting from a young media artist's perspective. It illustrates the artist's unique construction methods and the artistic conversion of knowledge in specific fields.",
    "video_link": "",
    "size": "",
    "duration": "",
    "tags": []
  },
  {
    "url": "https://eventstructure.com/berlin-transmediale",
    "title": "berlin@transmediale",
    "title_cn": "",
    "type": "Performance",
    "materials": "concept: aaajiao, zhang jian; sound: zhang jian @ fm3; computer graphics: aaajiao",
    "year": "2010",
    "description_cn": "",
    "description_en": "A performance artwork conceptualized by aaajiao and zhang jian, featuring sound design from zhang jian associated with fm3 and incorporating computer graphics by aaajiao.",
    "video_link": "",
    "size": "",
    "duration": "",
    "tags": []
  },
  {
    "url": "https://eventstructure.com/blogArchaeological-0",
    "title": "blogArchaeological 0",
    "title_cn": "Blog称重",
    "type": "Installation",
    "materials": "Electronic scale",
    "year": "2009",
    "description_cn": "使用电子秤为 Jorn Barger所建立的 RobotWisdom.com 的数据称重，选择RobotWisdom.com不仅是因为Jorn Barger创造了weblog一词，而是他本人除了是一名程序员之外还是未来派艺术家和詹姆斯•乔伊斯研究者，其blog内容更私人，涉及的信息更为广泛，且blog运行至今。为其称重，是试图探究数据的衡量标准在最传统的度量衡制度下表现，以此为引子研究数据的永恒性。",
    "description_en": "Weigh the data involved in RobotWisdom.com. The choice of the site is not only because his author Jorn Barger created the word weblog, but also because he is a programmer, artist and expert at the same time. His blog is more personal oriented, its contents cover a wider field and are still running today. Weighting is to try to explore how measure standard of data represents under the most traditional metrology system. Making it an opening words, we study the permanence of data.",
    "video_link": "",
    "size": "",
    "duration": "",
    "tags": []
  },
  {
    "url": "https://eventstructure.com/icon-006-008",
    "title": "icon 006",
    "title_cn": "icon 008",
    "type": "Screen printing",
    "materials": "Screen printing, chevron board, metal frame, acrylic paint / 丝网印刷, 雪弗板, 金属框, 水性漆",
    "year": "2019",
    "description_cn": "",
    "description_en": "icon 006 and icon 008 are part of a series created in 2019, utilizing screen printing techniques on chevron board framed with metal and embellished with acrylic paint. The pieces measure 99 x 99 cm and 79 x 99 cm respectively.",
    "video_link": "",
    "size": "",
    "duration": "",
    "tags": []
  },
  {
    "url": "https://eventstructure.com/icon-009-010",
    "title": "icon 009 / icon 010",
    "title_cn": "icon 009 / icon 010",
    "type": "Screen printing",
    "materials": "Screen printing, chevron board, metal frame, acrylic paint / 丝网印刷, 雪弗板, 金属框, 水性漆",
    "year": "2019-2020",
    "description_cn": "",
    "description_en": "icon 009 and icon 010 are screen printed artworks featuring a blend of modern materials like chevron board and metal framing, complemented by acrylic paint. Their dimensions are 95 × 95 cm for icon 009 and 88 × 80 cm for icon 010, created during the years 2019-2020.",
    "video_link": "",
    "size": "",
    "duration": "",
    "tags": []
  },
  {
    "url": "https://eventstructure.com/landscape004-gif",
    "title": "landscape004.gif",
    "title_cn": "",
    "type": "installation",
    "materials": "Led screen, gif / LED屏幕, gif",
    "year": "2019-2020",
    "description_cn": "",
    "description_en": "This artwork is a digital animation displayed on an LED screen, reflecting on the relationship between nature and technology. Measuring 64 x 128 x 6 cm, it was created between 2019 and 2020 and is part of an ongoing exploration of landscape in a digital age.",
    "video_link": "",
    "size": "",
    "duration": "",
    "tags": []
  }
]